--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/chrissoria/Documents/Research/1066/cadas_1066_comparison.log
  log type:  text
 opened on:  17 Nov 2025, 14:03:30

. 
. * ADAMS MODIFIED VERSION
. local num_repeats 10

. 
. forvalues r = 1/`num_repeats' {
  2.     set seed `r'010
  3.     
.     gen ranum = uniform()
  4.     sort ranum
  5.     drop ranum
  6.     
.     gen fold_`r' = mod(_n, 10) + 1
  7.     
.     gen k_fold_dem_pred_1066_`r' = .
  8.     
.     forvalues i = 1/10 {  
  9.         local train = "fold_`r' != `i'" 
 10.         local test = "fold_`r' == `i'"  
 11.         
.         quietly logit cdem1066 cogscore_cadas relscore_cadas recall if `train'
 12.         quietly predict p_`r'_`i' if `test', pr
 13.         
.         quietly replace k_fold_dem_pred_1066_`r' = p_`r'_`i' if `test'
 14.     }
 15. }
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)
(6,833 missing values generated)

. 
. gen total_pred = k_fold_dem_pred_1066_1 + k_fold_dem_pred_1066_2 + k_fold_dem_pred_1066_3 + k_fold_dem_pred_1066_4 + k_fold_dem_pred_1066_5 + k_fold_d
> em_pred_1066_6 + k_fold_dem_pred_1066_7 + k_fold_dem_pred_1066_8 + k_fold_dem_pred_1066_9 + k_fold_dem_pred_1066_10
(34 missing values generated)

. 
. gen k_fold_dem_pred_1066_av = total_pred/10
(34 missing values generated)

. 
. gen cdem1066pred50 = (k_fold_dem_pred_1066_av >= .5) if !missing(k_fold_dem_pred_1066_av)
(34 missing values generated)

. tab cdem1066pred50

cdem1066pre |
        d50 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,102       89.75       89.75
          1 |        697       10.25      100.00
------------+-----------------------------------
      Total |      6,799      100.00

. tab cdem1066 cdem1066pred50, matcell(conf_matrix)

 Education |
  adjusted |
      1066 |
    Lancet |
  dementia |    cdem1066pred50
 diagnosis |         0          1 |     Total
-----------+----------------------+----------
  non-case |     5,954         74 |     6,028 
      case |       138        622 |       760 
-----------+----------------------+----------
     Total |     6,092        696 |     6,788 

. 
. matrix list conf_matrix

conf_matrix[2,2]
      c1    c2
r1  5954    74
r2   138   622

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for 1066 .50: " Sensitivity
Sensitivity for 1066 .50: .81842105

. display "Specificity for 1066 .50: " Specificity
Specificity for 1066 .50: .98772395

. display "Accuracy for 1066 .50: " Accuracy
Accuracy for 1066 .50: .96876841

. display "Predicted Prevalence for 1066 ADAMS modified: " Prevalence
Predicted Prevalence for 1066 ADAMS modified: 10.253388

. display "Predicted Prevalence for 1066 original: " ((TP+FN) / (TP + TN + FP + FN))*100
Predicted Prevalence for 1066 original: 11.196229

. 
. roctab cdem1066 cdem1066pred50

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
         6,788     0.9031       0.0070        0.88929     0.91686

. 
. * CADAS VERSION
. logit cdem1066 cogscore_cadas relscore_cadas recall // coefficients coming from here

Iteration 0:  Log likelihood =  -2379.862  
Iteration 1:  Log likelihood = -851.34227  
Iteration 2:  Log likelihood = -566.06361  
Iteration 3:  Log likelihood = -518.90148  
Iteration 4:  Log likelihood = -517.67529  
Iteration 5:  Log likelihood = -517.67317  
Iteration 6:  Log likelihood = -517.67317  

Logistic regression                                    Number of obs =   6,788
                                                       LR chi2(3)    = 3724.38
                                                       Prob > chi2   =  0.0000
Log likelihood = -517.67317                            Pseudo R2     =  0.7825

--------------------------------------------------------------------------------
      cdem1066 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
cogscore_cadas |  -.4453795   .0295911   -15.05   0.000    -.5033771    -.387382
relscore_cadas |   .5031411   .0250798    20.06   0.000     .4539855    .5522967
        recall |  -.6978724   .0562487   -12.41   0.000    -.8081178    -.587627
         _cons |   8.571528   .6836945    12.54   0.000     7.231511    9.911544
--------------------------------------------------------------------------------
Note: 0 failures and 52 successes completely determined.

. predict cdem1066_prob, pr
(34 missing values generated)

. summarize cdem1066_prob

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cdem1066_p~b |      6,799    .1120047    .2794218   6.98e-06          1

. 
. gen cdem1066_cadas = (cdem1066_prob >= .5) if !missing(cdem1066_prob)
(34 missing values generated)

. tab cdem1066 cdem1066_cadas

 Education |
  adjusted |
      1066 |
    Lancet |
  dementia |    cdem1066_cadas
 diagnosis |         0          1 |     Total
-----------+----------------------+----------
  non-case |     5,955         73 |     6,028 
      case |       137        623 |       760 
-----------+----------------------+----------
     Total |     6,092        696 |     6,788 

. roctab cdem1066 cdem1066_cadas

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
         6,788     0.9038       0.0070        0.89007     0.91756

. 
. * CADAS VERSION WITH QUINTILES
. *using quintiles from cadas
. gen ncogscore_cadas = .
(6,833 missing values generated)

. replace ncogscore_cadas = 1 if cogscore <= 28.38926696777344
(1,700 real changes made)

. replace ncogscore_cadas = 2 if cogscore > 28.38926696777344 & cogscore <= 29.75679397583008
(1,045 real changes made)

. replace ncogscore_cadas = 3 if cogscore > 29.75679397583008 & cogscore <= 30.57880401611328
(928 real changes made)

. replace ncogscore_cadas = 4 if cogscore > 30.57880401611328 & cogscore <= 31.3485050201416
(1,074 real changes made)

. replace ncogscore_cadas = 5 if cogscore > 31.3485050201416 & cogscore != .
(2,086 real changes made)

. 
. gen nrelscore_cadas = .
(6,833 missing values generated)

. replace nrelscore_cadas = 1 if relscore <= 0
(1,968 real changes made)

. replace nrelscore_cadas = 2 if relscore > 0 & relscore <= .5
(1,063 real changes made)

. replace nrelscore_cadas = 3 if relscore > .5 & relscore <= 1.5
(1,855 real changes made)

. replace nrelscore_cadas = 4 if relscore > 1.5 & relscore <= 2.5
(640 real changes made)

. replace nrelscore_cadas = 5 if relscore > 2.5 & relscore != .
(1,276 real changes made)

. 
. gen ndelay_cadas = .
(6,833 missing values generated)

. replace ndelay_cadas = 1 if recall <= 2
(1,460 real changes made)

. replace ndelay_cadas = 2 if recall > 2 & recall <= 3
(925 real changes made)

. replace ndelay_cadas = 3 if recall > 3 & recall <= 4
(1,206 real changes made)

. replace ndelay_cadas = 4 if recall > 4 & recall <= 5
(1,275 real changes made)

. replace ndelay_cadas = 5 if recall > 5 & recall != .
(1,967 real changes made)

. 
. gen bcogscor_quint = .
(6,833 missing values generated)

. replace bcogscor_quint = 2.801  if ncogscore_cadas == 1
(1,700 real changes made)

. replace bcogscor_quint = 1.377  if ncogscore_cadas == 2
(1,045 real changes made)

. replace bcogscor_quint = 0.866  if ncogscore_cadas == 3
(928 real changes made)

. replace bcogscor_quint = -0.231 if ncogscore_cadas == 4
(1,074 real changes made)

. replace bcogscor_quint = 0      if ncogscore_cadas == 5 & ncogscore_cadas != .
(2,086 real changes made)

. 
. gen brelscor_quint = .
(6,833 missing values generated)

. replace brelscor_quint = 0     if nrelscore_cadas == 1
(1,968 real changes made)

. replace brelscor_quint = 1.908 if nrelscore_cadas == 2
(1,063 real changes made)

. replace brelscor_quint = 2.311 if nrelscore_cadas == 3
(1,855 real changes made)

. replace brelscor_quint = 4.171 if nrelscore_cadas == 4
(640 real changes made)

. replace brelscor_quint = 5.680 if nrelscore_cadas == 5 & nrelscore_cadas != .
(1,276 real changes made)

. 
. gen bdelay_quint = .
(6,833 missing values generated)

. replace bdelay_quint = 3.822 if ndelay_cadas == 1
(1,460 real changes made)

. replace bdelay_quint = 3.349 if ndelay_cadas == 2
(925 real changes made)

. replace bdelay_quint = 2.575 if ndelay_cadas == 3
(1,206 real changes made)

. replace bdelay_quint = 2.176 if ndelay_cadas == 4
(1,275 real changes made)

. replace bdelay_quint = 0     if ndelay_cadas == 5 & ndelay_cadas != .
(1,967 real changes made)

. 
. logit cdem1066 bcogscor_quint brelscor_quint bdelay_quint

Iteration 0:  Log likelihood = -2380.2181  
Iteration 1:  Log likelihood = -1463.4918  
Iteration 2:  Log likelihood = -925.61541  
Iteration 3:  Log likelihood = -743.15106  
Iteration 4:  Log likelihood = -713.23346  
Iteration 5:  Log likelihood = -711.91019  
Iteration 6:  Log likelihood = -711.90742  
Iteration 7:  Log likelihood = -711.90742  

Logistic regression                                    Number of obs =   6,791
                                                       LR chi2(3)    = 3336.62
                                                       Prob > chi2   =  0.0000
Log likelihood = -711.90742                            Pseudo R2     =  0.7009

--------------------------------------------------------------------------------
      cdem1066 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
bcogscor_quint |   1.840233   .1233908    14.91   0.000     1.598391    2.082074
brelscor_quint |    1.06126   .0533782    19.88   0.000      .956641     1.16588
  bdelay_quint |   1.544301   .1360249    11.35   0.000     1.277697    1.810905
         _cons |  -15.39542   .6487412   -23.73   0.000    -16.66693   -14.12391
--------------------------------------------------------------------------------

. predict cdem1066_quint_prob, pr
(31 missing values generated)

. 
. gen cdem1066_quint = (cdem1066_quint_prob >= .5) if !missing(cdem1066_quint_prob)
(31 missing values generated)

. tab cdem1066 cdem1066_quint

 Education |
  adjusted |
      1066 |
    Lancet |
  dementia |    cdem1066_quint
 diagnosis |         0          1 |     Total
-----------+----------------------+----------
  non-case |     5,858        173 |     6,031 
      case |       116        644 |       760 
-----------+----------------------+----------
     Total |     5,974        817 |     6,791 

. roctab cdem1066 cdem1066_quint

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
         6,791     0.9093       0.0066        0.89638     0.92231

. 
. log close
      name:  <unnamed>
       log:  /Users/chrissoria/Documents/Research/1066/cadas_1066_comparison.log
  log type:  text
 closed on:  17 Nov 2025, 14:03:38
--------------------------------------------------------------------------------------------------------------------------------------------------------
