
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Single-user , expiring  6 Aug 2026
Serial number: 401909206182
  Licensed to: Chris Soria
               UC Berkeley

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /Users/chrissoria/Documents/Research/1066/CADAS/do/cadas_1066_sensitivity.
> do 

. clear all 

. set more off

. capture log close

. 
. /* The purpose of this script is the following:
> 
> 1. to adjust the algorithm and test whether the adjustments brings it in line
>  a bit closer with the Cuban diagnosis
> 2. to identify the adjustments that improve its alignment with the cuban diag
> nosis
> 
> I will try to following:
> 
> 1. convert continuous variables into categorical based on quintile distributi
> on
> 2. down-weight the reslcore
> 3. convert the reslcore into a binary (5 or more = 1, else 0)
> 4. down-weight the relscore AND use as a categorical quintile
> 5. down-weight the relscore AND use as a binary
> */
. 
. *******ADJUST LOCALS HERE**********
. 
. ***********************************
. local user "Chris"  // Change this to "Will" to switch paths

. local country "CU"

. 
. *for now just using Cuba
. if "`country'" == "CU" {
. local Chris "/Users/chrissoria/Documents/CADAS/Data/CUBA_out"
. }

. 
. else if "`country'" == "DR" {
. local Chris "/Users/chrissoria/Documents/CADAS/Data/DR_out"
. }

. 
. 
. local Will "PATH"

. 
. local path = cond("`user'" == "Chris", "`Chris'", "`Will'")

. 
. cd "`path'"
/Users/chrissoria/Documents/CADAS/Data/CUBA_out

. 
. local wave 1

. 
. local drop_missing_from_relscore "no" // change to yes or no

. local drop_physical_disability "no"

. local impute_recall "no" //imputes the 10-word delayed recall from the immedi
> ate recall questions

. 
. *create a dummy for people that we recoded because of that disability
. 
. 
. ***** SCRIPT STARTS HERE *********
. 
. **********************************
. 
. use "`path'/Cog.dta"

. *until we clean all the data, we'll have to indiscriminantly drop duplicates
. duplicates report pid

Duplicates in terms of pid

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         1501             0
        2 |           20            10
        3 |            3             2
        4 |            4             3
--------------------------------------

. sort pid

. by pid: gen dup = _n == 1

. drop if dup == 0
(15 observations deleted)

. drop dup

. 
. merge 1:m pid using Infor, force
(label country_label already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            33
        from master                        19  (_merge==1)
        from using                         14  (_merge==2)

    Matched                             1,518  (_merge==3)
    -----------------------------------------

. duplicates report pid

Duplicates in terms of pid

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         1505             0
        2 |           36            18
        3 |            6             4
        4 |            4             3
--------------------------------------

. sort pid

. by pid: gen dup = _n == 1

. drop if dup == 0
(25 observations deleted)

. drop dup

. 
. rename _merge merge1

. 
. merge 1:m pid using Cog_Scoring, force

    Result                      Number of obs
    -----------------------------------------
    Not matched                            38
        from master                        35  (_merge==1)
        from using                          3  (_merge==2)

    Matched                             1,500  (_merge==3)
    -----------------------------------------

. duplicates report pid

Duplicates in terms of pid

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         1520             0
        2 |           18             9
--------------------------------------

. sort pid

. by pid: gen dup = _n == 1

. drop if dup == 0
(9 observations deleted)

. drop dup

. 
. duplicates report pid

Duplicates in terms of pid

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         1529             0
--------------------------------------

. 
. rename c_24 pencil

. rename c_25 watch

. rename c_48 chair

. rename c_49 shoes

. rename c_50 knuckle

. rename c_51 elbow

. rename c_52 should

. rename c_53 bridge

. rename c_54 hammer

. rename c_55 pray

. rename c_56 chemist

. rename c_26 repeat

. rename c_8 town

. gen chief = .
(1,529 missing values generated)

. if inlist("`country'", "CU", "DR") {
.     replace chief = cond(missing(c_70_d_c), 0, c_70_d_c)
(1,529 real changes made)
. }

. else {
.     replace chief = cond(missing(c_70_p), 0, c_70_p)
. }

. rename i_a2 street

. rename i_a3 store

. rename i_a4 address

. gen longmem = .
(1,529 missing values generated)

. if inlist("`country'", "CU", "DR") {
.     replace longmem = cond(missing(c_69_c),0,c_69_c) + cond(missing(c_69_d),0
> ,c_69_d)
(1,529 real changes made)
. }

. else {
.     replace longmem = cond(missing(c_69_p),0,c_69_p)
. }

. 
. rename c_3 month

. rename c_5 day

. rename c_1 year

. gen season = .
(1,529 missing values generated)

. if inlist("`country'", "CU", "DR") {
.     replace season = cond(missing(c_2_p_c),0,c_2_p_c) + cond(missing(c_2_d),0
> ,c_2_d)
(1,529 real changes made)
. }

. else {
.     replace season = cond(missing(c_2_p_c),0,c_2_p_c)
. }

. rename c_61 nod

. rename c_62 point

. rename cs_32 pentag

. rename c_32 pentag_diss

. rename cs_40 animals

. rename c_40 animals_diss

. 
. foreach var in c_11 c_12 c_13 c_21 c_22 c_23 {
  2.         replace `var' = 0 if `var' ==.i
  3. }
(11 real changes made)
(14 real changes made)
(16 real changes made)
(10 real changes made)
(14 real changes made)
(19 real changes made)

. 
. gen wordimm = c_11 + c_12 + c_13
(16 missing values generated)

. gen worddel = c_21 + c_22 + c_23
(16 missing values generated)

. 
. *for now coding to 0
. foreach var in c_27 c_28 c_29 {
  2.         replace `var' = 0 if `var' == 6 | `var' == 7
  3. }
(10 real changes made)
(11 real changes made)
(10 real changes made)

. gen paper = cond(missing(c_27),0,c_27) + cond(missing(c_28),0,c_28) + cond(mi
> ssing(c_29),0,c_29)

. 
. foreach var in c_66a c_66b c_66c c_66d c_66e c_66f {
  2.         tab `var'
  3.         replace `var' = 1 if `var' == 0 | `var' == 1
  4.         replace `var' = 0 if `var' == 2
  5.         replace `var' = 0 if `var' == .i
  6.         summarize `var'
  7. }

  66.A. tres niños |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |      1,128       76.32       76.32
     sí aproximada |        283       19.15       95.47
olvida el elemento |         67        4.53      100.00
-------------------+-----------------------------------
             Total |      1,478      100.00
(1,128 real changes made)
(67 real changes made)
(13 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66a |      1,491    .9463447    .2254117          0          1

     66.B. casa se |
          incendió |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |      1,032       70.01       70.01
     sí aproximada |        358       24.29       94.30
olvida el elemento |         84        5.70      100.00
-------------------+-----------------------------------
             Total |      1,474      100.00
(1,032 real changes made)
(84 real changes made)
(16 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66b |      1,490    .9328859    .2503035          0          1

      66.C. hombre |
    valiente logró |
           subirse |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |        792       53.88       53.88
     sí aproximada |        565       38.44       92.31
olvida el elemento |        113        7.69      100.00
-------------------+-----------------------------------
             Total |      1,470      100.00
(792 real changes made)
(113 real changes made)
(20 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66c |      1,490    .9107383    .2852169          0          1

  66.D. sacó a los |
             niños |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |        916       62.36       62.36
     sí aproximada |        435       29.61       91.97
olvida el elemento |        118        8.03      100.00
-------------------+-----------------------------------
             Total |      1,469      100.00
(916 real changes made)
(118 real changes made)
(21 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66d |      1,490    .9067114    .2909341          0          1

     66.E. heridas |
          pequeñas |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |        590       40.66       40.66
     sí aproximada |        375       25.84       66.51
olvida el elemento |        486       33.49      100.00
-------------------+-----------------------------------
             Total |      1,451      100.00
(590 real changes made)
(486 real changes made)
(39 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66e |      1,490     .647651    .4778624          0          1

 66.F. todos están |
              bien |      Freq.     Percent        Cum.
-------------------+-----------------------------------
         si exacta |        621       42.86       42.86
     sí aproximada |        304       20.98       63.84
olvida el elemento |        524       36.16      100.00
-------------------+-----------------------------------
             Total |      1,449      100.00
(621 real changes made)
(524 real changes made)
(41 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       c_66f |      1,490    .6208054    .4853495          0          1

. gen story = c_66a + c_66b + c_66c + c_66d + c_66e + c_66f
(39 missing values generated)

. 
. summarize story

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       story |      1,490    4.965101       1.259          0          6

. 
. rename c_66_a story_refuse

. gen learn1 = c_33_1 + c_33_2 + c_33_3 + c_33_4 + c_33_5 + c_33_6 + c_33_7 + c
> _33_8 + c_33_9 + c_33_10
(27 missing values generated)

. rename c_33_a learn1_refuse

. gen learn2 = c_34_1 + c_34_2 + c_34_3 + c_34_4 + c_34_5 + c_34_6 + c_34_7 + c
> _34_8 + c_34_9 + c_34_10
(29 missing values generated)

. rename c_34_a learn2_refuse

. gen learn3 = c_35_1 + c_35_2 + c_35_3 + c_35_4 + c_35_5 + c_35_6 + c_35_7 + c
> _35_8 + c_35_9 + c_35_10
(30 missing values generated)

. rename c_35_a learn3_refuse

. gen recall = c_63_1 + c_63_2 + c_63_3 + c_63_4 + c_63_5 + c_63_6 + c_63_7 + c
> _63_8 + c_63_9 + c_63_10
(47 missing values generated)

. rename c_63_a recall_refuse

. rename c_0 name

. rename c_65 nrecall

. 
. foreach var in story learn1 learn2 learn3 recall {
  2.         replace `var' = . if `var'_refuse == 7
  3. }
(4 real changes made, 4 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. if "`drop_physical_disability'" == "yes" {
. foreach var in pencil watch chair shoes knuckle elbow should bridge hammer pr
> ay chemist repeat street store address nod point {
  2.         replace `var' = . if `var' == 6 | `var' == 7 | `var' == 8 | `var' 
> == 9
  3. }
. 
. }

. 
. if "`drop_physical_disability'" == "no" {
. foreach var in pencil watch chair shoes knuckle elbow should bridge hammer pr
> ay chemist repeat street store address nod point {
  2.         replace `var' = 0 if `var' == 6 | `var' == 7 | `var' == 8 | `var' 
> == 9
  3. }
(10 real changes made)
(10 real changes made)
(8 real changes made)
(8 real changes made)
(15 real changes made)
(10 real changes made)
(10 real changes made)
(8 real changes made)
(7 real changes made)
(5 real changes made)
(7 real changes made)
(9 real changes made)
(11 real changes made)
(14 real changes made)
(10 real changes made)
(8 real changes made)
(10 real changes made)
. 
. }

. 
. if "`drop_physical_disability'" == "yes" {
. replace pentag = . if pentag_diss == 6 | pentag_diss == 7
. }

. 
. else if "`drop_physical_disability'" == "no" {
. replace pentag = 0 if pentag_diss == 6 | pentag_diss == 7
(16 real changes made)
. }

. 
. replace pentag = 1 if pentag == 2
(17 real changes made)

. 
. replace animals = . if animals == 777
(0 real changes made)

. * copying from original algo
. replace animals = . if animals > 45
(1 real change made, 1 to missing)

. 
. gen nametot = 0

. replace nametot = 1 if name > 0 & !missing(name)
(1,490 real changes made)

. replace nametot = 1 if nrecall > 0 & !missing(nrecall)
(4 real changes made)

. 
. *both types of skips (valid and invalid) will be removed
. foreach var in animals wordimm worddel paper story learn1 learn2 learn3 recal
> l pencil watch chair shoes knuckle elbow should bridge hammer pray chemist re
> peat town chief street store address longmem month day year season nod point 
>  pentag nametot nrecall {
  2.     replace `var' = . if `var' == .v | `var' == .i
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(14 real changes made, 14 to missing)
(5 real changes made, 5 to missing)
(12 real changes made, 12 to missing)
(5 real changes made, 5 to missing)
(5 real changes made, 5 to missing)
(7 real changes made, 7 to missing)
(4 real changes made, 4 to missing)
(5 real changes made, 5 to missing)
(8 real changes made, 8 to missing)
(6 real changes made, 6 to missing)
(4 real changes made, 4 to missing)
(5 real changes made, 5 to missing)
(9 real changes made, 9 to missing)
(0 real changes made)
(16 real changes made, 16 to missing)
(19 real changes made, 19 to missing)
(18 real changes made, 18 to missing)
(0 real changes made)
(13 real changes made, 13 to missing)
(6 real changes made, 6 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(5 real changes made, 5 to missing)
(10 real changes made, 10 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(3 real changes made, 3 to missing)

. 
. egen count = rowtotal(pencil watch chair shoes knuckle elbow should bridge ha
> mmer pray chemist repeat town chief street store address longmem month day ye
> ar season nod point pentag)

. 
. *max should be 27
. summarize count

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       count |      1,529    23.31465    3.231455          0         32

. 
. *this is only if we want to impute recall (which I don't think we want to)
. gen immed = cond(missing(learn1),0,learn1) + cond(missing(learn2),0,learn2) +
>  cond(missing(learn3),0,learn3)

. tab recall, miss

     recall |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        173       11.31       11.31
          1 |        165       10.79       22.11
          2 |        210       13.73       35.84
          3 |        229       14.98       50.82
          4 |        249       16.29       67.10
          5 |        202       13.21       80.31
          6 |        155       10.14       90.45
          7 |         68        4.45       94.90
          8 |         25        1.64       96.53
          9 |          3        0.20       96.73
         10 |          3        0.20       96.93
          . |         47        3.07      100.00
------------+-----------------------------------
      Total |      1,529      100.00

. tab immed, miss

      immed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         38        2.49        2.49
          1 |          3        0.20        2.68
          2 |          3        0.20        2.88
          3 |          2        0.13        3.01
          4 |          8        0.52        3.53
          5 |         13        0.85        4.38
          6 |         16        1.05        5.43
          7 |         22        1.44        6.87
          8 |         51        3.34       10.20
          9 |         74        4.84       15.04
         10 |         84        5.49       20.54
         11 |        118        7.72       28.25
         12 |        140        9.16       37.41
         13 |        153       10.01       47.42
         14 |        159       10.40       57.82
         15 |        130        8.50       66.32
         16 |        115        7.52       73.84
         17 |        120        7.85       81.69
         18 |        104        6.80       88.49
         19 |         57        3.73       92.22
         20 |         52        3.40       95.62
         21 |         40        2.62       98.23
         22 |         15        0.98       99.22
         23 |         10        0.65       99.87
         24 |          1        0.07       99.93
         25 |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,529      100.00

. 
. *dividing by total amount of possible correct answers to get a "total"
. 
. local divide_var "animals wordimm worddel paper story"

. local divisor "23 3 3 3 6"

. local new_column "animtot wordtot1 wordtot2 papertot storytot"

. 
. local n : word count `divide_var'

. 
. forval i = 1/`n' {
  2.     local col : word `i' of `divide_var'
  3.     local num : word `i' of `divisor'
  4.     local new : word `i' of `new_column'
  5.     
.     capture gen `new' = `col'/`num'
  6.     
.     if _rc capture replace `new' = `col'/`num'
  7. }

. 
. *all of these should max out to 1
. summarize animtot

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     animtot |      1,484    .6065569    .2352304          0   1.434783

. summarize wordtot1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    wordtot1 |      1,513     .978189    .1255564          0          1

. summarize wordtot2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    wordtot2 |      1,513    .6772417    .3629357          0          1

. summarize papertot

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    papertot |      1,529    .9354698    .1853995          0          1

. summarize storytot

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    storytot |      1,486    .8276133     .209985          0          1

. 
. 
. * generate the cogscore. anyone who does not have all components will be drop
> ped.
. gen cogscore = 1.03125 * (nametot + count + animtot + wordtot1 + wordtot2 + p
> apertot + storytot)
(78 missing values generated)

. 
. summarize cogscore

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    cogscore |      1,451    29.62623     2.31821   8.653533   37.87228

. 
. ***** relscore ********
. 
. ***********************
. 
. rename i_f_csid_1 activ

. rename i_f_csid_2 mental

. rename i_f_csid_3 memory

. rename i_f_csid_4 put

. rename i_f_csid_5 kept

. rename i_f_csid_6 frdname

. rename i_f_csid_7 famname

. rename i_f_csid_8 convers

. rename i_f_csid_9 wordfind

. rename i_f_csid_10 wordwrg

. rename i_f_csid_11 past

. rename i_f_csid_12 lastsee

. rename i_f_csid_13 lastday

. rename i_f_csid_14 orient

. rename i_f_csid_15 lostout

. rename i_f_csid_16 lostin

. rename i_f_csid_17 chores

. rename i_f_csid_17a choredis

. rename i_f_csid_18 hobby

. rename i_f_csid_19 money

. rename i_f_csid_20 change

. rename i_f_csid_21 reason

. rename i_f_csid_22_1 feed

. rename i_f_csid_22_2 feeddiss

. rename i_f_csid_23_1 dress

. rename i_f_csid_23_2 dressdiss

. rename i_f_csid_24_1 toilet

. rename i_f_csid_24_2 toildiss

. 
. * Creating binary missing indicators without changing the original missing va
> lues
. local miss1_variables "mental activ memory put kept frdname famname convers w
> ordfind wordwrg past lastsee lastday orient lostout lostin chores hobby money
>  change reason"

. 
. * Creating new binary variables for each original variable to indicate whethe
> r the value is missing
. foreach var of local miss1_variables {
  2.     gen missing_`var' = missing(`var')
  3. }

. 
. * Generating the miss1 variable by summing up the binary missing indicators
. egen miss1 = rowtotal(missing_mental missing_activ missing_memory /* 
>     */ missing_put missing_kept missing_frdname missing_famname /* 
>     */ missing_convers missing_wordfind missing_wordwrg missing_past /* 
>     */ missing_lastsee missing_lastday missing_orient missing_lostout /* 
>     */ missing_lostin missing_chores missing_hobby missing_money /* 
>     */ missing_change missing_reason)

. 
. 
. * counting up the remaining missing values to generate miss 3 variable
. local miss3_variables "feed dress toilet"

. 
. gen miss3 = 0

. 
. foreach var of local miss3_variables {
  2.     * Sum up the variables that are missing
.     replace miss3 = miss3 + missing(`var')
  3. }
(38 real changes made)
(38 real changes made)
(38 real changes made)

. 
. local all_miss "feed dress toilet"

. 
. foreach var of local all_miss {
  2.     gen missing_`var' = missing(`var')
  3. }

. 
. * Generating the miss1 variable by summing up the binary missing indicators
. egen all_miss = rowtotal(missing_mental missing_activ missing_memory /* 
>     */ missing_put missing_kept missing_frdname missing_famname /* 
>     */ missing_convers missing_wordfind missing_wordwrg missing_past /* 
>     */ missing_lastsee missing_lastday missing_orient missing_lostout /* 
>     */ missing_lostin missing_chores missing_hobby missing_money /* 
>     */ missing_change missing_reason missing_feed missing_dress missing_toile
> t)

.     
. replace miss1 = . if (all_miss ==24 & miss3 == .)
(0 real changes made)

. 
. gen misstot = (miss3 * 3) + miss1

. 
. /* below should be the correct logic
> replace misstot = . if misstot == 30
> replace misstot = 0 if misstot == .
> 
> replace misstot_duplicate = . if misstot_duplicate == 30
> replace misstot_duplicate = 0 if misstot_duplicate == .
> 
> */
. 
. summarize misstot

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     misstot |      1,529    .7285808    4.597288          0         30

. summarize miss1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       miss1 |      1,529    .5049052     3.20975          0         21

. summarize miss3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       miss3 |      1,529    .0745585    .4671824          0          3

. 
. foreach var in put kept frdname famname convers wordfind wordwrg past lastsee
>  lastday orient lostout lostin chores change money reason {
  2.     replace `var'= `var'/2
  3. }
variable put was long now double
(840 real changes made, 14 to missing)
variable kept was long now double
(470 real changes made, 14 to missing)
variable frdname was long now double
(317 real changes made, 15 to missing)
variable famname was long now double
(123 real changes made, 15 to missing)
variable convers was long now double
(289 real changes made, 15 to missing)
variable wordfind was long now double
(140 real changes made, 15 to missing)
variable wordwrg was long now double
(105 real changes made, 15 to missing)
variable past was long now double
(428 real changes made, 15 to missing)
variable lastsee was long now double
(90 real changes made, 15 to missing)
variable lastday was long now double
(174 real changes made, 15 to missing)
variable orient was long now double
(75 real changes made, 15 to missing)
variable lostout was long now double
(55 real changes made, 15 to missing)
variable lostin was long now double
(37 real changes made, 15 to missing)
variable chores was long now double
(204 real changes made, 15 to missing)
variable change was long now double
(156 real changes made, 15 to missing)
variable money was long now double
(169 real changes made, 15 to missing)
variable reason was long now double
(256 real changes made, 15 to missing)

. 
. if `wave' == 2 {
. replace chores = chores_original
. }

. 
. *this whole chunk of code produces no changes
. * Backup original 'dress' variable and recode if 'dressdis' is 1
. replace dress = 0 if dressdis == 1
(26 real changes made)

. 
. * Backup original 'chores' variable and recode if 'choredis' is 1
. replace chores = 0 if choredis == 1
(116 real changes made)

. 
. * Backup original 'feed' variable and recode if 'feeddis' is 1
. replace feed = 0 if feeddis == 1
(18 real changes made)

. 
. * Backup original 'toilet' variable and recode if 'toildis' is 1
. replace toilet = 0 if toildis == 1
(20 real changes made)

. 
. *replace misstot_duplicate = 0 if misstot_duplicate == .
. 
. if "`drop_missing_from_relscore'" == "yes" {
.     drop if misstot > 0
. }

. 
. gen S = cond(missing(activ), 0, activ) +  ///
>             cond(missing(mental), 0, mental) + ///
>             cond(missing(memory), 0, memory) + ///
>             cond(missing(put), 0, put) + ///
>             cond(missing(kept), 0, kept) + ///
>             cond(missing(frdname), 0, frdname) + ///
>             cond(missing(famname), 0, famname) + ///
>             cond(missing(convers), 0, convers) + ///
>             cond(missing(wordfind), 0, wordfind) + ///
>             cond(missing(wordwrg), 0, wordwrg) + ///
>             cond(missing(past), 0, past) + ///
>             cond(missing(lastsee), 0, lastsee) + ///
>             cond(missing(lastday), 0, lastday) + ///
>             cond(missing(orient), 0, orient) + ///
>             cond(missing(lostout), 0, lostout) + ///
>             cond(missing(lostin), 0, lostin) + ///
>             cond(missing(chores), 0, chores) + ///
>             cond(missing(hobby), 0, hobby) + ///
>             cond(missing(money), 0, money) + ///
>             cond(missing(change), 0, change) + ///
>             cond(missing(reason), 0, reason) + ///
>             cond(missing(feed), 0, feed) + ///
>             cond(missing(dress), 0, dress) + ///
>             cond(missing(toilet), 0, toilet)

. 
. gen U = 30 / (30 - misstot)
(36 missing values generated)

. replace U = cond(missing(misstot), 0, U)
(0 real changes made)

. 
. gen relscore_cadas = U*S
(36 missing values generated)

. 
. if "`impute_recall'" == "yes" {
.         gen recall_original = recall
. 
.         gen pred_recall = (0.344 * immed) - 0.339
.     
.         replace recall = pred_recall if recall == 0
. }

. 
. * HERE, I WILL CONVERT THE CONTINOUS VARIABLES WE HAVE INTO QUINTILE CATEGORI
> CALS
. * Create cognitive score categories
. gen ncogscor = .
(1,529 missing values generated)

. replace ncogscor = 1 if cogscore <= 23.699
(45 real changes made)

. replace ncogscor = 2 if cogscore > 23.699 & cogscore <= 28.619
(282 real changes made)

. replace ncogscor = 3 if cogscore > 28.619 & cogscore <= 30.619
(559 real changes made)

. replace ncogscor = 4 if cogscore > 30.619 & cogscore <= 31.839
(518 real changes made)

. replace ncogscor = 5 if cogscore > 31.839 & cogscore != .
(47 real changes made)

. 
. * Assign cognitive coefficients (from Table 5)
. gen bcogscor = .
(1,529 missing values generated)

. replace bcogscor = 2.801  if ncogscor == 1
(45 real changes made)

. replace bcogscor = 1.377  if ncogscor == 2
(282 real changes made)

. replace bcogscor = 0.866  if ncogscor == 3
(559 real changes made)

. replace bcogscor = -0.231 if ncogscor == 4
(518 real changes made)

. replace bcogscor = 0      if ncogscor == 5
(47 real changes made)

. 
. * Create informant score categories
. gen nrelscor = .
(1,529 missing values generated)

. replace nrelscor = 1 if relscore == 0
(384 real changes made)

. replace nrelscor = 2 if relscore > 0 & relscore <= 1.99
(655 real changes made)

. replace nrelscor = 3 if relscore > 1.99 & relscore <= 5.0
(328 real changes made)

. replace nrelscor = 4 if relscore > 5.0 & relscore <= 12.0
(97 real changes made)

. replace nrelscor = 5 if relscore > 12.0 & relscore != .
(29 real changes made)

. 
. * Assign informant coefficients (from Table 5)
. gen brelscor = .
(1,529 missing values generated)

. replace brelscor = 0     if nrelscor == 1
(384 real changes made)

. replace brelscor = 1.908 if nrelscor == 2
(655 real changes made)

. replace brelscor = 2.311 if nrelscor == 3
(328 real changes made)

. replace brelscor = 4.171 if nrelscor == 4
(97 real changes made)

. replace brelscor = 5.680 if nrelscor == 5
(29 real changes made)

. 
. * Create delayed recall categories
. gen ndelay = .
(1,529 missing values generated)

. replace ndelay = 1 if recall == 0
(173 real changes made)

. replace ndelay = 2 if recall >= 1 & recall <= 3
(604 real changes made)

. replace ndelay = 3 if recall == 4
(249 real changes made)

. replace ndelay = 4 if recall >= 5 & recall <= 6
(357 real changes made)

. replace ndelay = 5 if recall >= 7 & recall != .
(99 real changes made)

. 
. * Assign recall coefficients (from Table 5)
. gen bdelay = .
(1,529 missing values generated)

. replace bdelay = 3.822 if ndelay == 1
(173 real changes made)

. replace bdelay = 3.349 if ndelay == 2
(604 real changes made)

. replace bdelay = 2.575 if ndelay == 3
(249 real changes made)

. replace bdelay = 2.176 if ndelay == 4
(357 real changes made)

. replace bdelay = 0     if ndelay == 5
(99 real changes made)

. 
. * Quintiles
. xtile ncogscor_quint = cogscore, nq(5)

. xtile nrelscor_quint = relscore, nq(5)

. xtile ndelay_quint = recall, nq(5)

. 
. gen bcogscor_quint = .
(1,529 missing values generated)

. replace bcogscor_quint = 2.801  if ncogscor_quint == 1
(293 real changes made)

. replace bcogscor_quint = 1.377  if ncogscor_quint == 2
(290 real changes made)

. replace bcogscor_quint = 0.866  if ncogscor_quint == 3
(288 real changes made)

. replace bcogscor_quint = -0.231 if ncogscor_quint == 4
(291 real changes made)

. replace bcogscor_quint = 0      if ncogscor_quint == 5 & ncogscor_quint != .
(289 real changes made)

. 
. gen brelscor_quint = .
(1,529 missing values generated)

. replace brelscor_quint = 0     if nrelscor_quint == 1
(384 real changes made)

. replace brelscor_quint = 1.908 if nrelscor_quint == 2
(236 real changes made)

. replace brelscor_quint = 2.311 if nrelscor_quint == 3
(419 real changes made)

. replace brelscor_quint = 4.171 if nrelscor_quint == 4
(177 real changes made)

. replace brelscor_quint = 5.680 if nrelscor_quint == 5 & nrelscor_quint != .
(277 real changes made)

. 
. gen bdelay_quint = .
(1,529 missing values generated)

. replace bdelay_quint = 3.822 if ndelay_quint == 1
(338 real changes made)

. replace bdelay_quint = 3.349 if ndelay_quint == 2
(439 real changes made)

. replace bdelay_quint = 2.575 if ndelay_quint == 3
(249 real changes made)

. replace bdelay_quint = 2.176 if ndelay_quint == 4
(202 real changes made)

. replace bdelay_quint = 0     if ndelay_quint == 5 & ndelay_quint != .
(254 real changes made)

. 
. 
. * 1066 formulas
. 
. gen dem1066_score = exp(8.486511 -.4001659 * cogscore + .5024221 * relscore -
> .6997248 * recall) / (1 + exp(8.486511 -.4001659 * cogscore + .5024221 * rels
> core -.6997248 * recall))
(117 missing values generated)

. 
. gen dem1066 = .
(1,529 missing values generated)

. replace dem1066 = 1 if dem1066_score >= .5 & dem1066_score != .
(77 real changes made)

. replace dem1066 = 0 if dem1066_score <.5 & dem1066_score != .
(1,335 real changes made)

. 
. summarize dem1066

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     dem1066 |      1,412    .0545326     .227146          0          1

. 
. *linear model
. 
. gen dem1066_score_linear = .6936593 -.019811 * cogscore + .0319944 * relscore
>  -.0196586 * learn1
(105 missing values generated)

. 
. gen dem1066_linear = .
(1,529 missing values generated)

. replace dem1066_linear = 1 if dem1066_score_linear >= .5 & dem1066_score_line
> ar != .
(28 real changes made)

. replace dem1066_linear = 0 if dem1066_score_linear <.5 & dem1066_score_linear
>  != .
(1,396 real changes made)

. 
. *categorical version using 10/66 own categories
. gen dem1066_score_categorical_orig = exp(-17.71921 + 2.76109 * bcogscor + 1.8
> 36585 * brelscor + 2.126105 * bdelay) / (1 + exp(-17.71921 + 2.76109 * bcogsc
> or + 1.836585 * brelscor + 2.126105 * bdelay))
(117 missing values generated)

. 
. gen dem1066_categorical_orig = .
(1,529 missing values generated)

. replace dem1066_categorical_orig = 1 if dem1066_score_categorical_orig >= .5 
> & dem1066_score_categorical_orig != .
(89 real changes made)

. replace dem1066_categorical_orig = 0 if dem1066_score_categorical_orig <.5 & 
> dem1066_score_categorical_orig != .
(1,323 real changes made)

. 
. *categorical version using 10/66 own categories but quints from cadas
. gen dem1066_score_orig_quint = exp(-17.71921 + 2.76109 * bcogscor_quint + 1.8
> 36585 * brelscor_quint + 2.126105 * bdelay_quint) / (1 + exp(-17.71921 + 2.76
> 109 * bcogscor_quint + 1.836585 * brelscor_quint + 2.126105 * bdelay_quint))
(117 missing values generated)

. 
. gen dem1066_orig_quint = .
(1,529 missing values generated)

. replace dem1066_orig_quint = 1 if dem1066_score_orig_quint >= .5 & dem1066_sc
> ore_orig_quint != .
(326 real changes made)

. replace dem1066_orig_quint = 0 if dem1066_score_orig_quint <.5 & dem1066_scor
> e_orig_quint != .
(1,086 real changes made)

. 
. 
. *categorical version using quintiles based on our own data
. gen dem1066_score_quint = exp(-3.99328 - 2.147228 * ncogscor_quint + 1.857513
>  * nrelscor_quint - 1.312263 * ndelay_quint) / (1 + exp(-3.99328 - 2.147228 *
>  ncogscor_quint + 1.857513 * nrelscor_quint - 1.312263 * ndelay_quint))
(117 missing values generated)

. 
. gen dem1066_categorical_quint = .
(1,529 missing values generated)

. replace dem1066_categorical_quint = 1 if dem1066_score_quint >= .5 & dem1066_
> score_quint != .
(98 real changes made)

. replace dem1066_categorical_quint = 0 if dem1066_score_quint <.5 & dem1066_sc
> ore_quint != .
(1,314 real changes made)

. 
. *down-weighted relscore
. gen dem1066_score_downweighted = exp(8.486511 - .4001659 * cogscore + (.50242
> 21*.7) * relscore - .6997248 * recall) / (1 + exp(8.486511 - .4001659 * cogsc
> ore + (.5024221*.7) * relscore - .6997248 * recall))
(117 missing values generated)

. 
. gen dem1066_rel_downweighted = .
(1,529 missing values generated)

. replace dem1066_rel_downweighted = 1 if dem1066_score_downweighted >= .5 & de
> m1066_score_downweighted != .
(58 real changes made)

. replace dem1066_rel_downweighted = 0 if dem1066_score_downweighted <.5 & dem1
> 066_score_downweighted != .
(1,354 real changes made)

. 
. *binary relscore
. gen rel_binary = (relscore > 4) if relscore != .
(36 missing values generated)

. gen dem1066_score_binary = exp(9.736947 - .426476 * cogscore + 3.41575 * rel_
> binary - .6517573 * recall) / (1 + exp(9.736947 - .426476 * cogscore + 3.4157
> 5 * rel_binary - .6517573 * recall))
(117 missing values generated)

. 
. gen dem1066_rel_binary = .
(1,529 missing values generated)

. replace dem1066_rel_binary = 1 if dem1066_score_binary >= .5 & dem1066_score_
> binary != .
(92 real changes made)

. replace dem1066_rel_binary = 0 if dem1066_score_binary <.5 & dem1066_score_bi
> nary != .
(1,320 real changes made)

. 
. *quints from cadas
. gen dem1066_score_cadas = exp(-3.190348 - 2.113413 * ncogscor_quint + 1.63707
> 4 * nrelscor_quint - 1.119034 * ndelay_quint) / (1 + exp(-3.190348 - 2.113413
>  * ncogscor_quint + 1.637074 * nrelscor_quint - 1.119034 * ndelay_quint))
(117 missing values generated)

. 
. gen dem1066_cadas_quint = .
(1,529 missing values generated)

. replace dem1066_cadas_quint = 1 if dem1066_score_cadas >= .5 & dem1066_score_
> cadas != .
(112 real changes made)

. replace dem1066_cadas_quint = 0 if dem1066_score_cadas <.5 & dem1066_score_ca
> das != .
(1,300 real changes made)

. 
. *cog components
. gen dem1066_cog_comp_prob = exp(3.893365 + 3.724723*nametot - .5088708*count 
> - 1.091296*animtot + 1.470641*wordtot1 - 1.080204*wordtot2 + .4929788*paperto
> t + .2299829*storytot + .5421012*relscore - .7007926*recall) / (1 + exp(3.893
> 365 + 3.724723*nametot - .5088708*count - 1.091296*animtot + 1.470641*wordtot
> 1 - 1.080204*wordtot2 + .4929788*papertot + .2299829*storytot + .5421012*rels
> core - .7007926*recall))
(117 missing values generated)

. 
. gen dem1066_cog_comp = .
(1,529 missing values generated)

. replace dem1066_cog_comp = 1 if dem1066_cog_comp_prob >= .5 & dem1066_cog_com
> p_prob != .
(84 real changes made)

. replace dem1066_cog_comp = 0 if dem1066_cog_comp_prob <.5 & dem1066_cog_comp_
> prob != .
(1,328 real changes made)

. 
. *interacting cog and relscores
. gen cog_rel_interact = cogscore * relscore
(99 missing values generated)

. 
. gen dem1066_interact_prob = exp(3.902774 - .2340031*cogscore + 2.067158*relsc
> ore - .687096*recall - .0565224*(cogscore*relscore)) / (1 + exp(3.902774 - .2
> 340031*cogscore + 2.067158*relscore - .687096*recall - .0565224*(cogscore*rel
> score)))
(117 missing values generated)

. 
. gen dem1066_interact = .
(1,529 missing values generated)

. replace dem1066_interact = 1 if dem1066_interact_prob >= .5 & dem1066_interac
> t_prob != .
(72 real changes made)

. replace dem1066_interact = 0 if dem1066_interact_prob <.5 & dem1066_interact_
> prob != .
(1,340 real changes made)

. 
. *new model using learn1 with coefficients from 1066 data
. gen dem1066_new_learn1_prob = exp(9.9968 - 0.4860*cogscore + 0.4827*relscore 
> - 0.3430*learn1) / (1 + exp(9.9968 - 0.4860*cogscore + 0.4827*relscore - 0.34
> 30*learn1))
(105 missing values generated)

. 
. gen dem1066_new_learn1 = .
(1,529 missing values generated)

. replace dem1066_new_learn1 = 1 if dem1066_new_learn1_prob >= .5 & dem1066_new
> _learn1_prob != .
(66 real changes made)

. replace dem1066_new_learn1 = 0 if dem1066_new_learn1_prob <.5 & dem1066_new_l
> earn1_prob != .
(1,358 real changes made)

. 
. *new model using learn3 with coefficients from 1066 data
. gen dem1066_new_learn3_prob = exp(10.01594 - 0.4458829*cogscore + 0.4776*rels
> core - 0.441638*learn3) / (1 + exp(10.01594 - 0.4458829*cogscore + 0.4776*rel
> score - 0.441638*learn3))
(108 missing values generated)

. 
. gen dem1066_new_learn3 = .
(1,529 missing values generated)

. replace dem1066_new_learn3 = 1 if dem1066_new_learn3_prob >= .5 & dem1066_new
> _learn3_prob != .
(68 real changes made)

. replace dem1066_new_learn3 = 0 if dem1066_new_learn3_prob <.5 & dem1066_new_l
> earn3_prob != .
(1,353 real changes made)

. 
. 
. * now let's check accuracy for each one against CDR
. local preds dem1066 dem1066_linear dem1066_categorical_orig dem1066_categoric
> al_quint dem1066_rel_downweighted dem1066_rel_binary dem1066_cadas_quint dem1
> 066_orig_quint dem1066_cog_comp dem1066_interact dem1066_new_learn1 dem1066_n
> ew_learn3

. 
. 
. preserve

. tempfile results

. postfile handle str30 var sensitivity specificity accuracy auc TP TN FP FN me
> an_var mean_CDR overall_mean using `results', replace
(file /var/folders/89/6bdxzk2j30v5n3wstywbcpg80000gn/T//St35466.000002 not
    found)

. 
. foreach var of local preds {
  2.     * mean for entire sample:
.     quietly summarize `var'
  3.     local overall_mean = r(mean)
  4. 
.     * mean for the subset:
.     quietly summarize `var' if cuba_CDR_binary != .
  5.     local mean_var = r(mean)
  6. 
.     * Now restrict to non-missing CDR for all below
.     tab cuba_CDR_binary `var' if cuba_CDR_binary != ., matcell(freq)
  7.     local TP = freq[2,2]
  8.     local TN = freq[1,1]
  9.     local FP = freq[1,2]
 10.     local FN = freq[2,1]
 11.     local sens = (`TP'/(`TP'+`FN'))
 12.     local spec = (`TN'/(`TN'+`FP'))
 13.     local acc = ((`TP'+`TN')/(`TP'+`TN'+`FP'+`FN'))
 14.     roctab cuba_CDR_binary `var' if cuba_CDR_binary != ., nograph
 15.     local auc = r(area)
 16.     quietly summarize cuba_CDR_binary
 17.     local mean_CDR = r(mean)
 18. 
.     post handle ("`var'") (`sens') (`spec') (`acc') (`auc') (`TP') (`TN') (`F
> P') (`FN') (`mean_var') (`mean_CDR') (`overall_mean')
 19. }

cuba_CDR_b |        dem1066
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       226          5 |       231 
         1 |        39         27 |        66 
-----------+----------------------+----------
     Total |       265         32 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6937       0.0309        0.63322     0.75422

cuba_CDR_b |    dem1066_linear
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       230          1 |       231 
         1 |        56         11 |        67 
-----------+----------------------+----------
     Total |       286         12 |       298 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           298     0.5799       0.0229        0.53504     0.62481

           | dem1066_categorical_o
cuba_CDR_b |          rig
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       223          8 |       231 
         1 |        39         27 |        66 
-----------+----------------------+----------
     Total |       262         35 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6872       0.0311        0.62631     0.74815

           | dem1066_categorical_q
cuba_CDR_b |         uint
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       219         12 |       231 
         1 |        44         22 |        66 
-----------+----------------------+----------
     Total |       263         34 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6407       0.0301        0.58163     0.69976

           | dem1066_rel_downweigh
cuba_CDR_b |          ted
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       228          3 |       231 
         1 |        45         21 |        66 
-----------+----------------------+----------
     Total |       273         24 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6526       0.0291        0.59551     0.70968

cuba_CDR_b |  dem1066_rel_binary
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       222          9 |       231 
         1 |        38         28 |        66 
-----------+----------------------+----------
     Total |       260         37 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6926       0.0313        0.63128     0.75400

cuba_CDR_b |  dem1066_cadas_quint
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       217         14 |       231 
         1 |        40         26 |        66 
-----------+----------------------+----------
     Total |       257         40 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6667       0.0313        0.60531     0.72803

cuba_CDR_b |  dem1066_orig_quint
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       187         44 |       231 
         1 |        16         50 |        66 
-----------+----------------------+----------
     Total |       203         94 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.7835       0.0296        0.72561     0.84149

cuba_CDR_b |   dem1066_cog_comp
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       225          6 |       231 
         1 |        38         28 |        66 
-----------+----------------------+----------
     Total |       263         34 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6991       0.0311        0.63819     0.76008

cuba_CDR_b |   dem1066_interact
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       226          5 |       231 
         1 |        42         24 |        66 
-----------+----------------------+----------
     Total |       268         29 |       297 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           297     0.6710       0.0302        0.61177     0.73022

cuba_CDR_b |  dem1066_new_learn1
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       227          4 |       231 
         1 |        46         21 |        67 
-----------+----------------------+----------
     Total |       273         25 |       298 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           298     0.6481       0.0289        0.59147     0.70465

cuba_CDR_b |  dem1066_new_learn3
     inary |         0          1 |     Total
-----------+----------------------+----------
         0 |       227          4 |       231 
         1 |        45         22 |        67 
-----------+----------------------+----------
     Total |       272         26 |       298 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           298     0.6555       0.0292        0.59825     0.71279

. postclose handle

. 
. use `results', clear

. export delimited using "1066_CDR_sens_spec_output.csv", replace
file 1066_CDR_sens_spec_output.csv saved

. 
. restore

. 
. drop _merge

. 
. save 1066_sensitivity.dta, replace
file 1066_sensitivity.dta saved

. 
. use "../consensus/consensus_long.dta", clear

. keep pid finalniaa_int_binary

. sort pid

. by pid: gen dup = _n == 1

. keep if dup
(5,398 observations deleted)

. drop dup

. 
. save "../consensus/unique_classifications.dta", replace
file ../consensus/unique_classifications.dta saved

. use 1066_sensitivity, clear

. 
. merge m:1 pid using "../consensus/unique_classifications.dta"
(variable pid was str8, now str10 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,531
        from master                     1,081  (_merge==1)
        from using                        450  (_merge==2)

    Matched                               448  (_merge==3)
    -----------------------------------------

. 
. save 1066_sensitivity.dta, replace 
file 1066_sensitivity.dta saved

. 
. preserve

. tempfile results

. postfile handle str30 var sensitivity specificity accuracy auc TP TN FP FN me
> an_var mean_CDR overall_mean using `results', replace
(file /var/folders/89/6bdxzk2j30v5n3wstywbcpg80000gn/T//St35466.000004 not
    found)

. 
. foreach var of local preds {
  2.     * mean for entire sample:
.     quietly summarize `var'
  3.     local overall_mean = r(mean)
  4. 
.     * mean for the subset:
.     quietly summarize `var' if finalniaa_int_binary != .
  5.     local mean_var = r(mean)
  6. 
.     * Now restrict to non-missing CDR for all below
.     tab finalniaa_int_binary `var' if cuba_CDR_binary != ., matcell(freq)
  7.     local TP = freq[2,2]
  8.     local TN = freq[1,1]
  9.     local FP = freq[1,2]
 10.     local FN = freq[2,1]
 11.     local sens = (`TP'/(`TP'+`FN'))
 12.     local spec = (`TN'/(`TN'+`FP'))
 13.     local acc = ((`TP'+`TN')/(`TP'+`TN'+`FP'+`FN'))
 14.     roctab finalniaa_int_binary `var' if finalniaa_int_binary != ., nograp
> h
 15.     local auc = r(area)
 16.     quietly summarize finalniaa_int_binary
 17.     local mean_CDR = r(mean)
 18. 
.     post handle ("`var'") (`sens') (`spec') (`acc') (`auc') (`TP') (`TN') (`F
> P') (`FN') (`mean_var') (`mean_CDR') (`overall_mean')
 19. }

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |        dem1066
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       135          1 |       136 
   Dementia |         5          8 |        13 
------------+----------------------+----------
      Total |       140          9 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.8040       0.0703        0.66620     0.94183

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |    dem1066_linear
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       136          0 |       136 
   Dementia |        13          1 |        14 
------------+----------------------+----------
      Total |       149          1 |       150 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           150     0.5357       0.0357        0.46572     0.60571

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no | dem1066_categorical_o
  dementia, |          rig
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       131          5 |       136 
   Dementia |         6          7 |        13 
------------+----------------------+----------
      Total |       137         12 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.7508       0.0724        0.60893     0.89277

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no | dem1066_categorical_q
  dementia, |         uint
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       132          4 |       136 
   Dementia |         7          6 |        13 
------------+----------------------+----------
      Total |       139         10 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.7161       0.0723        0.57432     0.85781

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no | dem1066_rel_downweigh
  dementia, |          ted
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       135          1 |       136 
   Dementia |         8          5 |        13 
------------+----------------------+----------
      Total |       143          6 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.6886       0.0703        0.55081     0.82645

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |  dem1066_rel_binary
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       133          3 |       136 
   Dementia |         4          9 |        13 
------------+----------------------+----------
      Total |       137         12 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.8351       0.0669        0.70397     0.96628

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |  dem1066_cadas_quint
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       129          7 |       136 
   Dementia |         7          6 |        13 
------------+----------------------+----------
      Total |       136         13 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.7050       0.0726        0.56278     0.84729

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |  dem1066_orig_quint
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       103         33 |       136 
   Dementia |         1         12 |        13 
------------+----------------------+----------
      Total |       104         45 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.8402       0.0427        0.75661     0.92382

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |   dem1066_cog_comp
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       133          3 |       136 
   Dementia |         4          9 |        13 
------------+----------------------+----------
      Total |       137         12 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.8351       0.0669        0.70397     0.96628

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |   dem1066_interact
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       135          1 |       136 
   Dementia |         7          6 |        13 
------------+----------------------+----------
      Total |       142          7 |       149 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           149     0.7271       0.0720        0.58588     0.86831

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |  dem1066_new_learn1
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       135          1 |       136 
   Dementia |         9          5 |        14 
------------+----------------------+----------
      Total |       144          6 |       150 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           150     0.6749       0.0665        0.54446     0.80533

Internation |
         al |
  consensus |
on dementia |
  diagnosis |
      (0=no |
  dementia, |  dem1066_new_learn3
1=dementia) |         0          1 |     Total
------------+----------------------+----------
No dementia |       135          1 |       136 
   Dementia |         8          6 |        14 
------------+----------------------+----------
      Total |       143          7 |       150 

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           150     0.7106       0.0687        0.57591     0.84531

. postclose handle

. use `results', clear

. export delimited using "1066_consensus_sens_spec_output.csv", replace
file 1066_consensus_sens_spec_output.csv saved

. 
. restore

. 
. *the below is only for analyzing the output to compare against 10/66 algo
. 
. keep pid cuba_CDR_binary relscore cogscore nametot count animals_diss animals
>  animtot wordtot1 wordtot2 papertot c_66a c_66b c_66c c_66d c_66e c_66f story
>  storytot pencil watch chair shoes knuckle elbow should bridge hammer pray ch
> emist repeat town street store address month day year nod point pentag pentag
> _diss animals animals_diss chief longmem season c_11 c_12 c_13 wordimm c_21 c
> _22 c_23 worddel misstot activ mental memory put kept frdname famname convers
>  wordfind wordwrg past lastsee lastday orient lostout lostin chores hobby mon
> ey change reason feed dress toilet recall dem1066 dem1066_linear dem1066_cate
> gorical_orig dem1066_categorical_quint dem1066_rel_downweighted dem1066_rel_b
> inary dem1066_cadas_quint dem1066_orig_quint S finalniaa_int_binary immed lea
> rn1 learn2 learn3 bcogscor_quint  ncogscor_quint dem1066_new_learn1 dem1066_n
> ew_learn3

. 
. order pid cuba_CDR_binary relscore cogscore nametot count animals_diss animal
> s animtot wordtot1 wordtot2 papertot c_66a c_66b c_66c c_66d c_66e c_66f stor
> y storytot pencil watch chair shoes knuckle elbow should bridge hammer pray c
> hemist repeat town street store address month day year nod point pentag penta
> g_diss animals animals_diss chief longmem season c_11 c_12 c_13 wordimm c_21 
> c_22 c_23 worddel misstot activ mental memory put kept frdname famname conver
> s wordfind wordwrg past lastsee lastday orient lostout lostin chores hobby mo
> ney change reason feed dress toilet recall dem1066 dem1066_linear dem1066_cat
> egorical_orig dem1066_categorical_quint dem1066_rel_downweighted dem1066_rel_
> binary dem1066_cadas_quint dem1066_orig_quint S finalniaa_int_binary immed le
> arn1 learn2 learn3 bcogscor_quint  ncogscor_quint dem1066_new_learn1 dem1066_
> new_learn3

. 
. preserve

. * Define the variables as a local macro
. local vars relscore cogscore nametot count animals animtot wordtot1 wordtot2 
> papertot story storytot pencil watch chair shoes knuckle elbow should bridge 
> hammer pray chemist repeat town street store address month day year nod point
>  pentag chief longmem season wordimm worddel misstot activ mental memory put 
> kept frdname famname convers wordfind wordwrg past lastsee lastday orient los
> tout lostin chores hobby money change reason feed dress toilet recall dem1066
>  dem1066_linear dem1066_categorical_orig dem1066_categorical_quint dem1066_re
> l_downweighted dem1066_rel_binary dem1066_cadas_quint dem1066_orig_quint S im
> med learn1 learn2 learn3 bcogscor_quint ncogscor_quint dem1066_new_learn1 dem
> 1066_new_learn3

. 
. * Get mean, min, and max for each variable and save as rows in one table
. postfile handle str32 variable mean min max using results_temp.dta, replace

. foreach v of local vars {
  2.     quietly summarize `v'
  3.     post handle ("`v'") (r(mean)) (r(min)) (r(max))
  4. }

. postclose handle

. 
. use results_temp.dta, clear

. 
. export delimited using "/Users/chrissoria/Documents/CADAS/Data/Cuba_Out/cadas
> _1066_diagnostics.csv", replace
file /Users/chrissoria/Documents/CADAS/Data/Cuba_Out/cadas_1066_diagnostics.csv
>  saved

. 
. restore

. 
end of do-file
