--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive.log
  log type:  text
 opened on:   1 May 2024, 21:41:32

. 
. ** set sample inclusion
. egen in_samp = rowmiss(AAGE RELSCORE COGSCORE dementia cogtot27_imp2002 ragender raeduc)

. *525 people have no missingness across the board, mostly due to the cogscore variable
. *nobody is missing age
. egen in_AAGE = rowmiss(AAGE)

. *nobody is missing relscore
. egen in_RELSCORE = rowmiss(RELSCORE)

. *927 people missing a cogscore, only 589 people have a full cogscore
. egen in_COGSCORE = rowmiss(COGSCORE)

. *nobody is missing the dementia score
. egen in_dementia = rowmiss(dementia)

. *416 people are missing this score, 1,100 people have a score
. egen in_cogtot27_imp2002 = rowmiss(cogtot27_imp2002)

. *nobody is missing gender or education
. egen in_ragender = rowmiss(ragender)

. keep if in_samp == 0
(991 observations deleted)

. count
  525

. egen in_samp2 = rowmiss(hurd_p expert_p lasso_p)

. 
. keep if in_samp2 == 0
(56 observations deleted)

. count
  469

. 
. ** table 2 **
. tab female

     female |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        207       44.14       44.14
          1 |        262       55.86      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab AAGE_cat

   AAGE_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        248       52.88       52.88
          2 |        221       47.12      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        206       43.92       43.92
          2 |        114       24.31       68.23
          3 |        149       31.77      100.00
------------+-----------------------------------
      Total |        469      100.00

. 
. 
. ** table 3 **
. 
. ******  1066    ******
. 
. **********************
. 
. logit dementia COGSCORE RELSCORE aRECALLcs

Iteration 0:  Log likelihood = -173.51716  
Iteration 1:  Log likelihood = -94.511498  
Iteration 2:  Log likelihood =  -70.63717  
Iteration 3:  Log likelihood = -66.583216  
Iteration 4:  Log likelihood = -66.507819  
Iteration 5:  Log likelihood =  -66.50758  
Iteration 6:  Log likelihood =  -66.50758  

Logistic regression                                     Number of obs =    469
                                                        LR chi2(3)    = 214.02
                                                        Prob > chi2   = 0.0000
Log likelihood = -66.50758                              Pseudo R2     = 0.6167

------------------------------------------------------------------------------
    dementia | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    COGSCORE |  -.6536885   .1292856    -5.06   0.000    -.9070837   -.4002934
    RELSCORE |   .6088116   .1175163     5.18   0.000     .3784839    .8391393
   aRECALLcs |  -.6703239   .1463282    -4.58   0.000     -.957122   -.3835259
       _cons |   7.351315   1.582112     4.65   0.000     4.250432     10.4522
------------------------------------------------------------------------------

. gen inreg1066=e(sample)

. predict dem_pred_1066
(option pr assumed; Pr(dementia))

. estat classification, cutoff(.25)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        47            23  |         70
     -     |        10           389  |        399
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .25
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   82.46%
Specificity                     Pr( -|~D)   94.42%
Positive predictive value       Pr( D| +)   67.14%
Negative predictive value       Pr(~D| -)   97.49%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    5.58%
False - rate for true D         Pr( -| D)   17.54%
False + rate for classified +   Pr(~D| +)   32.86%
False - rate for classified -   Pr( D| -)    2.51%
--------------------------------------------------
Correctly classified                        92.96%
--------------------------------------------------

. estat classification, cutoff(.50)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        36            12  |         48
     -     |        21           400  |        421
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .5
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   63.16%
Specificity                     Pr( -|~D)   97.09%
Positive predictive value       Pr( D| +)   75.00%
Negative predictive value       Pr(~D| -)   95.01%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    2.91%
False - rate for true D         Pr( -| D)   36.84%
False + rate for classified +   Pr(~D| +)   25.00%
False - rate for classified -   Pr( D| -)    4.99%
--------------------------------------------------
Correctly classified                        92.96%
--------------------------------------------------

. estat classification, cutoff(.12903368)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        54            39  |         93
     -     |         3           373  |        376
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .1290337
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   94.74%
Specificity                     Pr( -|~D)   90.53%
Positive predictive value       Pr( D| +)   58.06%
Negative predictive value       Pr(~D| -)   99.20%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    9.47%
False - rate for true D         Pr( -| D)    5.26%
False + rate for classified +   Pr(~D| +)   41.94%
False - rate for classified -   Pr( D| -)    0.80%
--------------------------------------------------
Correctly classified                        91.04%
--------------------------------------------------

. cutpt dementia dem_pred_1066

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               dem_pred_1066
Empirical optimal cutpoint:            .12903368
Sensitivity at cutpoint:               0.95
Specificity at cutpoint:               0.91
Area under ROC curve at cutpoint:      0.93

. 
. *optimal
. rocreg dementia dem_pred_1066
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50.........60......
> ...70.........80.........90.........100.........110.........120.........130.........140.........150...
> ......160.........170.........180.........190.........200.........210.........220.........230.........
> 240.........250.........260.........270.........280.........290.........300.........310.........320...
> ......330.........340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........480.........490...
> ......500.........510.........520.........530.........540.........550.........560.........570.........
> 580.........590.........600.........610.........620.........630.........640.........650.........660...
> ......670.........680.........690.........700.........710.........720.........730.........740.........
> 750.........760.........770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900.........910.........
> 920.........930.........940.........950.........960.........970.........980.........990.........1,000 
> done

Bootstrap results                                        Number of obs =   469
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: dem_pred_1066
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |     .969937  -.0002173    .0072422     .9557426   .9841314  (N)
             |                                        .9539429   .9822792  (P)
             |                                        .9530857   .9819993 (BC)
------------------------------------------------------------------------------

.         gen dem_pred_bin_1066 = (dem_pred_1066 >= .12903368) if !missing(dem_pred_1066)

. tab dementia dem_pred_bin_1066, matcell(conf_matrix)

           |   dem_pred_bin_1066
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       373         39 |       412 
         1 |         3         54 |        57 
-----------+----------------------+----------
     Total |       376         93 |       469 

. display "Predicted Prevalence from 1066 optimal cutoff: " (93/469) * 100
Predicted Prevalence from 1066 optimal cutoff: 19.829424

. 
. *ascribed
. gen dem_pred_bin_1066a50= (dem_pred_1066 >= .5) if !missing(dem_pred_1066)

. tab dem_pred_bin_1066a50

dem_pred_bi |
  n_1066a50 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        421       89.77       89.77
          1 |         48       10.23      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_bin_1066a50, matcell(conf_matrix)

           | dem_pred_bin_1066a50
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       400         12 |       412 
         1 |        21         36 |        57 
-----------+----------------------+----------
     Total |       421         48 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  400   12
r2   21   36

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for 1066 .5: " Sensitivity
Sensitivity for 1066 .5: .97087379

. display "Specificity for 1066 .5: " Specificity
Specificity for 1066 .5: .63157895

. display "Accuracy for 1066 .5: " Accuracy
Accuracy for 1066 .5: .92963753

. display "Predicted Prevalence for 1066 .5: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence for 1066 .5: 89.765458

. 
. roctab dementia dem_pred_bin_1066a50

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.8012       0.0325        0.73754     0.86492

. 
. display "Predicted Prevalence from 1066 .5 cutoff: " (75/469) * 100
Predicted Prevalence from 1066 .5 cutoff: 15.991471

. 
. gen dem_pred_bin_1066a25 = (dem_pred_1066 >= .25) if !missing(dem_pred_1066)

. tab dem_pred_bin_1066a25

dem_pred_bi |
  n_1066a25 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        399       85.07       85.07
          1 |         70       14.93      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_bin_1066a25, matcell(conf_matrix)

           | dem_pred_bin_1066a25
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       389         23 |       412 
         1 |        10         47 |        57 
-----------+----------------------+----------
     Total |       399         70 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  389   23
r2   10   47

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for 1066 .25: " Sensitivity
Sensitivity for 1066 .25: .94417476

. display "Specificity for 1066 .25: " Specificity
Specificity for 1066 .25: .8245614

. display "Accuracy for 1066 .25: " Accuracy
Accuracy for 1066 .25: .92963753

. display "Predicted Prevalence for 1066 .25: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence for 1066 .25: 85.074627

. roctab dementia dem_pred_bin_1066a25

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.8844       0.0260        0.83334     0.93540

. 
. 
. *****  hrs, tics   *******
. 
. **************************
. 
. gen cogtot27_imp2002_binary = 2 if cogtot27_imp2002 <7
(400 missing values generated)

. replace cogtot27_imp2002_binary = 0 if cogtot27_imp2002 >6
(400 real changes made)

. 
. gen cogtot27_imp2002_categorical = 2 if cogtot27_imp2002 < 7
(400 missing values generated)

. replace cogtot27_imp2002_categorical = 1 if cogtot27_imp2002 >= 7 & cogtot27_imp2002 < 12
(161 real changes made)

. replace cogtot27_imp2002_categorical = 0 if cogtot27_imp2002 >= 12
(239 real changes made)

. 
. logit dementia cogtot27_imp2002

Iteration 0:  Log likelihood = -173.51716  
Iteration 1:  Log likelihood = -147.75699  
Iteration 2:  Log likelihood = -143.25439  
Iteration 3:  Log likelihood = -143.19508  
Iteration 4:  Log likelihood = -143.19507  

Logistic regression                                     Number of obs =    469
                                                        LR chi2(1)    =  60.64
                                                        Prob > chi2   = 0.0000
Log likelihood = -143.19507                             Pseudo R2     = 0.1747

----------------------------------------------------------------------------------
        dementia | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
cogtot27_imp2002 |  -.2854829   .0437242    -6.53   0.000    -.3711808    -.199785
           _cons |     .81195   .3890814     2.09   0.037     .0493644    1.574536
----------------------------------------------------------------------------------

. gen inregtics=e(sample)

. predict dem_pred_lw
(option pr assumed; Pr(dementia))

. estat classification, cutoff(.13094532)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        45           121  |        166
     -     |        12           291  |        303
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .1309453
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   78.95%
Specificity                     Pr( -|~D)   70.63%
Positive predictive value       Pr( D| +)   27.11%
Negative predictive value       Pr(~D| -)   96.04%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   29.37%
False - rate for true D         Pr( -| D)   21.05%
False + rate for classified +   Pr(~D| +)   72.89%
False - rate for classified -   Pr( D| -)    3.96%
--------------------------------------------------
Correctly classified                        71.64%
--------------------------------------------------

. cutpt dementia dem_pred_lw

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               dem_pred_lw
Empirical optimal cutpoint:            .13094532
Sensitivity at cutpoint:               0.79
Specificity at cutpoint:               0.71
Area under ROC curve at cutpoint:      0.75

. 
. rocreg dementia dem_pred_lw
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50.........60......
> ...70.........80.........90.........100.........110.........120.........130.........140.........150...
> ......160.........170.........180.........190.........200.........210.........220.........230.........
> 240.........250.........260.........270.........280.........290.........300.........310.........320...
> ......330.........340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........480.........490...
> ......500.........510.........520.........530.........540.........550.........560.........570.........
> 580.........590.........600.........610.........620.........630.........640.........650.........660...
> ......670.........680.........690.........700.........710.........720.........730.........740.........
> 750.........760.........770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900.........910.........
> 920.........930.........940.........950.........960.........970.........980.........990.........1,000 
> done

Bootstrap results                                        Number of obs =   469
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: dem_pred_lw
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |     .782107   .0027664    .0264344     .7302964   .8339175  (N)
             |                                        .7308031    .834253  (P)
             |                                        .7218826   .8262429 (BC)
------------------------------------------------------------------------------

.         gen dem_pred_bin_lw = (dem_pred_lw >= .13094532) if !missing(dem_pred_lw)

. tab dementia dem_pred_bin_lw

           |    dem_pred_bin_lw
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       291        121 |       412 
         1 |        12         45 |        57 
-----------+----------------------+----------
     Total |       303        166 |       469 

. 
. display "Predicted Prevalence from HRS TICS optimal cutoff: " (166/469) * 100
Predicted Prevalence from HRS TICS optimal cutoff: 35.394456

. 
. gen dem_pred_lwa = 0

.         replace dem_pred_lwa = 1 if cogtot27_imp2002 >= 0 & cogtot27_imp2002 <= 6
(69 real changes made)

. 
. 
. tab dem_pred_lwa

dem_pred_lw |
          a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        400       85.29       85.29
          1 |         69       14.71      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_lwa, matcell(conf_matrix)

           |     dem_pred_lwa
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       365         47 |       412 
         1 |        35         22 |        57 
-----------+----------------------+----------
     Total |       400         69 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  365   47
r2   35   22

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for tics ascribed: " Sensitivity
Sensitivity for tics ascribed: .88592233

. display "Specificity for tics ascribed: " Specificity
Specificity for tics ascribed: .38596491

. display "Accuracy for tics ascribed: " Accuracy
Accuracy for tics ascribed: .82515991

. 
. display "Predicted Prevalence from HRS TICS ascribed: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence from HRS TICS ascribed: 85.287846

. roctab dementia dem_pred_lwa

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.6359       0.0335        0.57037     0.70152

. 
. *****  expert *****
. 
. *******************
. logit dementia expert_p

Iteration 0:  Log likelihood = -173.51716  
Iteration 1:  Log likelihood = -144.96771  
Iteration 2:  Log likelihood = -130.64138  
Iteration 3:  Log likelihood = -129.53186  
Iteration 4:  Log likelihood = -129.53043  
Iteration 5:  Log likelihood = -129.53043  

Logistic regression                                     Number of obs =    469
                                                        LR chi2(1)    =  87.97
                                                        Prob > chi2   = 0.0000
Log likelihood = -129.53043                             Pseudo R2     = 0.2535

------------------------------------------------------------------------------
    dementia | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    expert_p |   4.550381   .5262858     8.65   0.000      3.51888    5.581882
       _cons |  -3.271462   .2576646   -12.70   0.000    -3.776476   -2.766449
------------------------------------------------------------------------------

. gen inregexpert=e(sample)

. predict dem_pred_expert
(option pr assumed; Pr(dementia))

. estat classification, cutoff(.5)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        15            14  |         29
     -     |        42           398  |        440
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .5
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   26.32%
Specificity                     Pr( -|~D)   96.60%
Positive predictive value       Pr( D| +)   51.72%
Negative predictive value       Pr(~D| -)   90.45%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    3.40%
False - rate for true D         Pr( -| D)   73.68%
False + rate for classified +   Pr(~D| +)   48.28%
False - rate for classified -   Pr( D| -)    9.55%
--------------------------------------------------
Correctly classified                        88.06%
--------------------------------------------------

. estat classification, cutoff(.09578772)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        43            77  |        120
     -     |        14           335  |        349
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .0957877
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   75.44%
Specificity                     Pr( -|~D)   81.31%
Positive predictive value       Pr( D| +)   35.83%
Negative predictive value       Pr(~D| -)   95.99%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   18.69%
False - rate for true D         Pr( -| D)   24.56%
False + rate for classified +   Pr(~D| +)   64.17%
False - rate for classified -   Pr( D| -)    4.01%
--------------------------------------------------
Correctly classified                        80.60%
--------------------------------------------------

. cutpt dementia dem_pred_expert

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               dem_pred_expert
Empirical optimal cutpoint:            .08421316
Sensitivity at cutpoint:               0.84
Specificity at cutpoint:               0.80
Area under ROC curve at cutpoint:      0.82

. 
. display "Predicted Prevalence from expert optimal cutoff: " (167/469) * 100
Predicted Prevalence from expert optimal cutoff: 35.607676

. 
. *optimal
. rocreg dementia dem_pred_expert
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50.........60......
> ...70.........80.........90.........100.........110.........120.........130.........140.........150...
> ......160.........170.........180.........190.........200.........210.........220.........230.........
> 240.........250.........260.........270.........280.........290.........300.........310.........320...
> ......330.........340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........480.........490...
> ......500.........510.........520.........530.........540.........550.........560.........570.........
> 580.........590.........600.........610.........620.........630.........640.........650.........660...
> ......670.........680.........690.........700.........710.........720.........730.........740.........
> 750.........760.........770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900.........910.........
> 920.........930.........940.........950.........960.........970.........980.........990.........1,000 
> done

Bootstrap results                                        Number of obs =   469
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: dem_pred_expert
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |    .8719128   .0000838    .0226308     .8275572   .9162684  (N)
             |                                        .8233279     .91209  (P)
             |                                         .818396   .9083363 (BC)
------------------------------------------------------------------------------

.         gen dem_pred_bin_expert = (dem_pred_expert >= .09578772) if !missing(dem_pred_expert)

. tab dementia dem_pred_bin_expert

           |  dem_pred_bin_expert
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       335         77 |       412 
         1 |        14         43 |        57 
-----------+----------------------+----------
     Total |       349        120 |       469 

. 
. *ascribed
. gen dem_pred_experta = (dem_pred_expert >= .5) if !missing(dem_pred_expert)

. tab dem_pred_experta

dem_pred_ex |
      perta |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        440       93.82       93.82
          1 |         29        6.18      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_experta, matcell(conf_matrix)

           |   dem_pred_experta
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       398         14 |       412 
         1 |        42         15 |        57 
-----------+----------------------+----------
     Total |       440         29 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  398   14
r2   42   15

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for expert ascribed: " Sensitivity
Sensitivity for expert ascribed: .96601942

. display "Specificity for expert ascribed: " Specificity
Specificity for expert ascribed: .26315789

. display "Accuracy for expert ascribed: " Accuracy
Accuracy for expert ascribed: .88059701

. display "Predicted Prevalence for expert ascribed: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence for expert ascribed: 93.816631

. 
. roctab dementia dem_pred_experta

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.6146       0.0298        0.55626     0.67292

. 
. 
. ******  hurd  ********
. 
. **********************
. 
. logit dementia hurd_p

Iteration 0:  Log likelihood = -173.51716  
Iteration 1:  Log likelihood = -143.03749  
Iteration 2:  Log likelihood = -130.68435  
Iteration 3:  Log likelihood = -129.43526  
Iteration 4:  Log likelihood = -129.43132  
Iteration 5:  Log likelihood = -129.43132  

Logistic regression                                     Number of obs =    469
                                                        LR chi2(1)    =  88.17
                                                        Prob > chi2   = 0.0000
Log likelihood = -129.43132                             Pseudo R2     = 0.2541

------------------------------------------------------------------------------
    dementia | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      hurd_p |   5.587128   .6678017     8.37   0.000     4.278261    6.895995
       _cons |  -3.217317   .2480257   -12.97   0.000    -3.703439   -2.731196
------------------------------------------------------------------------------

. gen inreghurd=e(sample)

. predict dem_pred_hurd
(option pr assumed; Pr(dementia))

. estat classification, cutoff(.5)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        16            11  |         27
     -     |        41           401  |        442
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .5
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   28.07%
Specificity                     Pr( -|~D)   97.33%
Positive predictive value       Pr( D| +)   59.26%
Negative predictive value       Pr(~D| -)   90.72%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    2.67%
False - rate for true D         Pr( -| D)   71.93%
False + rate for classified +   Pr(~D| +)   40.74%
False - rate for classified -   Pr( D| -)    9.28%
--------------------------------------------------
Correctly classified                        88.91%
--------------------------------------------------

. estat classification, cutoff(.07790542)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        49            94  |        143
     -     |         8           318  |        326
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .0779054
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   85.96%
Specificity                     Pr( -|~D)   77.18%
Positive predictive value       Pr( D| +)   34.27%
Negative predictive value       Pr(~D| -)   97.55%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   22.82%
False - rate for true D         Pr( -| D)   14.04%
False + rate for classified +   Pr(~D| +)   65.73%
False - rate for classified -   Pr( D| -)    2.45%
--------------------------------------------------
Correctly classified                        78.25%
--------------------------------------------------

. cutpt dementia dem_pred_hurd

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               dem_pred_hurd
Empirical optimal cutpoint:            .07262582
Sensitivity at cutpoint:               0.91
Specificity at cutpoint:               0.75
Area under ROC curve at cutpoint:      0.83

. display "Predicted Prevalence from hurd optimal cutoff: " (189/469) * 100
Predicted Prevalence from hurd optimal cutoff: 40.298507

. 
. *optimal
. rocreg dementia dem_pred_hurd
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50.........60......
> ...70.........80.........90.........100.........110.........120.........130.........140.........150...
> ......160.........170.........180.........190.........200.........210.........220.........230.........
> 240.........250.........260.........270.........280.........290.........300.........310.........320...
> ......330.........340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........480.........490...
> ......500.........510.........520.........530.........540.........550.........560.........570.........
> 580.........590.........600.........610.........620.........630.........640.........650.........660...
> ......670.........680.........690.........700.........710.........720.........730.........740.........
> 750.........760.........770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900.........910.........
> 920.........930.........940.........950.........960.........970.........980.........990.........1,000 
> done

Bootstrap results                                        Number of obs =   469
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: dem_pred_hurd
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |    .8820048   .0005909    .0221124     .8386653   .9253442  (N)
             |                                        .8368512   .9191201  (P)
             |                                        .8325672   .9170073 (BC)
------------------------------------------------------------------------------

.         gen dem_pred_bin_hurd = (dem_pred_hurd >= .07790542) if !missing(dem_pred_hurd)

. tab dementia dem_pred_bin_hurd

           |   dem_pred_bin_hurd
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       318         94 |       412 
         1 |         8         49 |        57 
-----------+----------------------+----------
     Total |       326        143 |       469 

. 
. *ascribed
. gen dem_pred_hurda = (dem_pred_hurd >= .5) if !missing(dem_pred_hurd)

. tab dem_pred_hurda

dem_pred_hu |
        rda |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        442       94.24       94.24
          1 |         27        5.76      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_hurda, matcell(conf_matrix)

           |    dem_pred_hurda
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       401         11 |       412 
         1 |        41         16 |        57 
-----------+----------------------+----------
     Total |       442         27 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  401   11
r2   41   16

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for hurd ascribed: " Sensitivity
Sensitivity for hurd ascribed: .97330097

. display "Specificity for hurd ascribed: " Specificity
Specificity for hurd ascribed: .28070175

. display "Accuracy for hurd ascribed: " Accuracy
Accuracy for hurd ascribed: .8891258

. display "Predicted Prevalence for hurd ascribed: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence for hurd ascribed: 94.24307

. roctab dementia dem_pred_hurda

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.6270       0.0303        0.56764     0.68636

. 
. ******  lasso  *******
. 
. **********************
. 
. logit dementia lasso_p

Iteration 0:  Log likelihood = -173.51716  
Iteration 1:  Log likelihood =   -133.569  
Iteration 2:  Log likelihood = -115.97664  
Iteration 3:  Log likelihood = -114.46111  
Iteration 4:  Log likelihood = -114.45675  
Iteration 5:  Log likelihood = -114.45675  

Logistic regression                                     Number of obs =    469
                                                        LR chi2(1)    = 118.12
                                                        Prob > chi2   = 0.0000
Log likelihood = -114.45675                             Pseudo R2     = 0.3404

------------------------------------------------------------------------------
    dementia | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     lasso_p |   6.178661   .6734941     9.17   0.000     4.858636    7.498685
       _cons |  -3.800856   .3122093   -12.17   0.000    -4.412775   -3.188937
------------------------------------------------------------------------------

. gen inreglasso=e(sample)

. predict dem_pred_lasso
(option pr assumed; Pr(dementia))

. estat classification, cutoff(.5)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        24            12  |         36
     -     |        33           400  |        433
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .5
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   42.11%
Specificity                     Pr( -|~D)   97.09%
Positive predictive value       Pr( D| +)   66.67%
Negative predictive value       Pr(~D| -)   92.38%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)    2.91%
False - rate for true D         Pr( -| D)   57.89%
False + rate for classified +   Pr(~D| +)   33.33%
False - rate for classified -   Pr( D| -)    7.62%
--------------------------------------------------
Correctly classified                        90.41%
--------------------------------------------------

. estat classification, cutoff(.16165452)

Logistic model for dementia

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |        44            49  |         93
     -     |        13           363  |        376
-----------+--------------------------+-----------
   Total   |        57           412  |        469

Classified + if predicted Pr(D) >= .1616545
True D defined as dementia != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   77.19%
Specificity                     Pr( -|~D)   88.11%
Positive predictive value       Pr( D| +)   47.31%
Negative predictive value       Pr(~D| -)   96.54%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   11.89%
False - rate for true D         Pr( -| D)   22.81%
False + rate for classified +   Pr(~D| +)   52.69%
False - rate for classified -   Pr( D| -)    3.46%
--------------------------------------------------
Correctly classified                        86.78%
--------------------------------------------------

. cutpt dementia dem_pred_lasso

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               dem_pred_lasso
Empirical optimal cutpoint:            .14725079
Sensitivity at cutpoint:               0.79
Specificity at cutpoint:               0.88
Area under ROC curve at cutpoint:      0.83

. display "Predicted Prevalence from lasso optimal cutoff: " (124/469) * 100
Predicted Prevalence from lasso optimal cutoff: 26.439232

. 
. *optimal
. rocreg dementia dem_pred_lasso
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50.........60......
> ...70.........80.........90.........100.........110.........120.........130.........140.........150...
> ......160.........170.........180.........190.........200.........210.........220.........230.........
> 240.........250.........260.........270.........280.........290.........300.........310.........320...
> ......330.........340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........480.........490...
> ......500.........510.........520.........530.........540.........550.........560.........570.........
> 580.........590.........600.........610.........620.........630.........640.........650.........660...
> ......670.........680.........690.........700.........710.........720.........730.........740.........
> 750.........760.........770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900.........910.........
> 920.........930.........940.........950.........960.........970.........980.........990.........1,000 
> done

Bootstrap results                                        Number of obs =   469
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: dem_pred_lasso
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |    .9010816   .0003289    .0207506     .8604111   .9417521  (N)
             |                                        .8597445   .9373005  (P)
             |                                        .8564981   .9364407 (BC)
------------------------------------------------------------------------------

.         gen dem_pred_bin_lasso = (dem_pred_lasso >= .16165452) if !missing(dem_pred_lasso)

. tab dementia dem_pred_bin_lasso

           |  dem_pred_bin_lasso
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       363         49 |       412 
         1 |        13         44 |        57 
-----------+----------------------+----------
     Total |       376         93 |       469 

. 
. *ascribed (.9010816)
. gen dem_pred_lassoa = (dem_pred_lasso >= .5) if !missing(dem_pred_lasso)

. tab dem_pred_lassoa

dem_pred_la |
       ssoa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        433       92.32       92.32
          1 |         36        7.68      100.00
------------+-----------------------------------
      Total |        469      100.00

. tab dementia dem_pred_lassoa, matcell(conf_matrix)

           |    dem_pred_lassoa
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       400         12 |       412 
         1 |        33         24 |        57 
-----------+----------------------+----------
     Total |       433         36 |       469 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  400   12
r2   33   24

. 
. scalar TP = conf_matrix[1,1]

. scalar FN = conf_matrix[1,2]

. scalar FP = conf_matrix[2,1]

. scalar TN = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. 
. display "Sensitivity for lasso ascribed: " Sensitivity
Sensitivity for lasso ascribed: .97087379

. display "Specificity for lasso ascribed: " Specificity
Specificity for lasso ascribed: .42105263

. display "Accuracy for lasso ascribed: " Accuracy
Accuracy for lasso ascribed: .90405117

. display "Predicted Prevalence for lasso ascribed: " ((TP+FP) / (TP + TN + FP + FN))*100
Predicted Prevalence for lasso ascribed: 92.324094

. 
. roctab dementia dem_pred_lassoa

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           469     0.6960       0.0332        0.63080     0.76113

. 
. ** education gradients [optimal cutpoints]
. foreach dem_var in dementia dem_pred_bin_1066 dem_pred_bin_lw dem_pred_bin_expert dem_pred_bin_hurd de
> m_pred_bin_lasso {
  2. forvalues r=1/2 {
  3. display "****start: `dem_var' `r'****"
  4. qui: logit `dem_var' ib2.educat AAGE AAGE2 if AAGE_cat == `r'
  5.         margins educat, post
  6.         eststo `dem_var'_`r'
  7.         }
  8. }
****start: dementia 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1047682   .0299095     3.50   0.000     .0461467    .1633897
          2  |   .0148941    .014783     1.01   0.314      -.01408    .0438683
          3  |   .0264027   .0184108     1.43   0.152    -.0096818    .0624873
------------------------------------------------------------------------------
****start: dementia 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |    .184248   .0370828     4.97   0.000      .111567    .2569289
          2  |   .2489225   .0603611     4.12   0.000     .1306169     .367228
          3  |   .1726805   .0438455     3.94   0.000     .0867449     .258616
------------------------------------------------------------------------------
****start: dem_pred_bin_1066 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2198604   .0404995     5.43   0.000     .1404829    .2992379
          2  |   .0444705   .0250912     1.77   0.076    -.0047073    .0936484
          3  |   .0527866   .0256664     2.06   0.040     .0024815    .1030917
------------------------------------------------------------------------------
****start: dem_pred_bin_1066 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |    .340735   .0455158     7.49   0.000     .2515257    .4299442
          2  |   .3574074   .0680679     5.25   0.000     .2239967    .4908181
          3  |   .1572874    .042504     3.70   0.000     .0739811    .2405936
------------------------------------------------------------------------------
****start: dem_pred_bin_lw 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_lw), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .5598601   .0486276    11.51   0.000     .4645517    .6551685
          2  |    .203876   .0486543     4.19   0.000     .1085154    .2992366
          3  |    .092072   .0331361     2.78   0.005     .0271265    .1570175
------------------------------------------------------------------------------
****start: dem_pred_bin_lw 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_lw), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .5571317    .048302    11.53   0.000     .4624614    .6518019
          2  |   .3380002   .0679873     4.97   0.000     .2047475    .4712529
          3  |   .1980651   .0465804     4.25   0.000     .1067692     .289361
------------------------------------------------------------------------------
****start: dem_pred_bin_expert 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_expert), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1970782   .0381856     5.16   0.000     .1222357    .2719206
          2  |   .1071513   .0378394     2.83   0.005     .0329874    .1813152
          3  |   .0396215   .0223269     1.77   0.076    -.0041385    .0833814
------------------------------------------------------------------------------
****start: dem_pred_bin_expert 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_expert), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .4296462   .0476078     9.02   0.000     .3363366    .5229558
          2  |   .5280969   .0714746     7.39   0.000     .3880092    .6681846
          3  |   .2833798   .0520989     5.44   0.000     .1812678    .3854919
------------------------------------------------------------------------------
****start: dem_pred_bin_hurd 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_hurd), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3025361   .0443504     6.82   0.000     .2156109    .3894614
          2  |   .1064072   .0377176     2.82   0.005      .032482    .1803325
          3  |   .0791615   .0308491     2.57   0.010     .0186984    .1396247
------------------------------------------------------------------------------
****start: dem_pred_bin_hurd 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_hurd), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .5075297   .0478837    10.60   0.000     .4136795      .60138
          2  |   .5066206   .0712156     7.11   0.000     .3670407    .6462006
          3  |   .3123794   .0530993     5.88   0.000     .2083067    .4164522
------------------------------------------------------------------------------
****start: dem_pred_bin_lasso 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_lasso), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1488838   .0338848     4.39   0.000     .0824708    .2152968
          2  |   .0466628   .0260763     1.79   0.074    -.0044458    .0977714
          3  |   .0528929   .0255197     2.07   0.038     .0028753    .1029105
------------------------------------------------------------------------------
****start: dem_pred_bin_lasso 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_lasso), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3507153   .0453442     7.73   0.000     .2618423    .4395883
          2  |   .4176161   .0690427     6.05   0.000      .282295    .5529372
          3  |   .2005297   .0464167     4.32   0.000     .1095546    .2915048
------------------------------------------------------------------------------

. 
. *in this data there are zero cases of dem_pred_experta if AAGE_CAT == 1
. *same thing for dem_pred_hurda and dem_pred_lassoa
. *I will remove it for now and ask Jordan about it
. tab AAGE_cat dem_pred_experta

           |   dem_pred_experta
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       246          2 |       248 
         2 |       194         27 |       221 
-----------+----------------------+----------
     Total |       440         29 |       469 

. tab AAGE_cat dem_pred_hurda

           |    dem_pred_hurda
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       245          3 |       248 
         2 |       197         24 |       221 
-----------+----------------------+----------
     Total |       442         27 |       469 

. tab AAGE_cat dem_pred_lassoa

           |    dem_pred_lassoa
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       242          6 |       248 
         2 |       191         30 |       221 
-----------+----------------------+----------
     Total |       433         36 |       469 

. 
. ** education gradients [ascribed]
. foreach dem_var in dementia dem_pred_bin_1066a25 dem_pred_bin_1066a50 dem_pred_lwa dem_pred_experta de
> m_pred_hurda dem_pred_lassoa{
  2. forvalues r=1/2 {
  3. display "****start: `dem_var' `r'****"
  4. qui: logit `dem_var' ib2.educat AAGE AAGE2 if AAGE_cat == `r'
  5.         margins educat, post
  6.         eststo `dem_var'_`r'
  7.         }
  8. }
****start: dementia 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1047682   .0299095     3.50   0.000     .0461467    .1633897
          2  |   .0148941    .014783     1.01   0.314      -.01408    .0438683
          3  |   .0264027   .0184108     1.43   0.152    -.0096818    .0624873
------------------------------------------------------------------------------
****start: dementia 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |    .184248   .0370828     4.97   0.000      .111567    .2569289
          2  |   .2489225   .0603611     4.12   0.000     .1306169     .367228
          3  |   .1726805   .0438455     3.94   0.000     .0867449     .258616
------------------------------------------------------------------------------
****start: dem_pred_bin_1066a25 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1522086   .0350704     4.34   0.000     .0834719    .2209452
          2  |   .0298907   .0208139     1.44   0.151    -.0109039    .0706853
          3  |   .0395869    .022383     1.77   0.077     -.004283    .0834568
------------------------------------------------------------------------------
****start: dem_pred_bin_1066a25 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2626054   .0426073     6.16   0.000     .1790968    .3461141
          2  |   .2527831    .062206     4.06   0.000     .1308616    .3747047
          3  |   .1424231   .0409302     3.48   0.001     .0622013    .2226448
------------------------------------------------------------------------------
****start: dem_pred_bin_1066a50 1****

Predictive margins                                         Number of obs = 248
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a50), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .0962335   .0289737     3.32   0.001     .0394461     .153021
          2  |   .0146635   .0145606     1.01   0.314    -.0138747    .0432018
          3  |    .026351   .0183838     1.43   0.152    -.0096806    .0623827
------------------------------------------------------------------------------
****start: dem_pred_bin_1066a50 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a50), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1941251   .0378279     5.13   0.000     .1199839    .2682664
          2  |   .1444653   .0494067     2.92   0.003       .04763    .2413006
          3  |   .1153755   .0375078     3.08   0.002     .0418616    .1888895
------------------------------------------------------------------------------
****start: dem_pred_lwa 1****

Predictive margins                                         Number of obs = 172
Model VCE: OIM

Expression: Pr(dem_pred_lwa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2584358   .0426435     6.06   0.000      .174856    .3420155
          2  |   .0445814   .0251234     1.77   0.076    -.0046595    .0938224
------------------------------------------------------------------------------
****start: dem_pred_lwa 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_lwa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2738242   .0438916     6.24   0.000     .1877983    .3598502
          2  |   .1486623   .0518119     2.87   0.004     .0471129    .2502118
          3  |   .0559792   .0271533     2.06   0.039     .0027596    .1091987
------------------------------------------------------------------------------
****start: dem_pred_experta 1****

Predictive margins                                         Number of obs = 172
Model VCE: OIM

Expression: Pr(dem_pred_experta), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .0090784   .0090144     1.01   0.314    -.0085896    .0267464
          2  |   .0161576   .0159605     1.01   0.311    -.0151243    .0474396
------------------------------------------------------------------------------
****start: dem_pred_experta 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_experta), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1553665   .0345588     4.50   0.000     .0876325    .2231004
          2  |   .1636322   .0511949     3.20   0.001      .063292    .2639723
          3  |   .0435602   .0243401     1.79   0.074    -.0041454    .0912659
------------------------------------------------------------------------------
****start: dem_pred_hurda 1****

Predictive margins                                         Number of obs = 172
Model VCE: OIM

Expression: Pr(dem_pred_hurda), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .0188567   .0132244     1.43   0.154    -.0070627    .0447761
          2  |   .0151683   .0150748     1.01   0.314    -.0143778    .0447145
------------------------------------------------------------------------------
****start: dem_pred_hurda 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_hurda), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1260469   .0318847     3.95   0.000      .063554    .1885397
          2  |    .143841   .0490089     2.93   0.003     .0477852    .2398967
          3  |   .0579659   .0277639     2.09   0.037     .0035497    .1123821
------------------------------------------------------------------------------
****start: dem_pred_lassoa 1****

Predictive margins                                         Number of obs = 172
Model VCE: OIM

Expression: Pr(dem_pred_lassoa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .0467478   .0203913     2.29   0.022     .0067816    .0867139
          2  |   .0154076   .0152783     1.01   0.313    -.0145374    .0453525
------------------------------------------------------------------------------
****start: dem_pred_lassoa 2****

Predictive margins                                         Number of obs = 221
Model VCE: OIM

Expression: Pr(dem_pred_lassoa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1552877   .0346853     4.48   0.000     .0873057    .2232696
          2  |   .1852026   .0540513     3.43   0.001     .0792639    .2911412
          3  |   .0723334   .0306768     2.36   0.018      .012208    .1324588
------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive.log
  log type:  text
 closed on:   1 May 2024, 21:42:16
--------------------------------------------------------------------------------------------------------
