------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive_98_to_0.log
  log type:  text
 opened on:  10 Oct 2024, 22:00:00

. 
. drop if ADFDX1 == .
(701 observations deleted)

. 
. count
  815

. gen white = 0

. replace white = 1 if race_cat == 1
(578 real changes made)

. 
. gen black = 0

. replace black = 1 if race_cat == 2
(153 real changes made)

. 
. gen hispanic = 0

. replace hispanic = 1 if race_cat == 3
(84 real changes made)

. 
. gen college_grad = 0

. replace college_grad = 1 if raeduc > 2
(393 real changes made)

. 
. replace female = 0
(475 real changes made)

. replace female = 1 if ragender == 2
(475 real changes made)

. 
. gen married = 0

. replace married = 1 if AAMARRD == 2
(321 real changes made)

. 
. gen core_proxy = 0

. replace core_proxy = 1 if HPROXY == 5
(621 real changes made)

. 
. summarize AAGE

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        AAGE |        815     81.4638    7.030356         70        110

. summarize white

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       white |        815    .7092025    .4544092          0          1

. summarize black

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       black |        815    .1877301    .3907362          0          1

. summarize hispanic

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    hispanic |        815    .1030675    .3042337          0          1

. summarize college_grad

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
college_grad |        815    .4822086    .4999902          0          1

. summarize female

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      female |        815    .5828221    .4933956          0          1

. summarize married

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     married |        815     .393865    .4889056          0          1

. summarize dementia

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dementia |        815    .3460123    .4759893          0          1

. summarize AACOGSTR

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    AACOGSTR |        815    3.030675    1.443546          1          5

. 
. /*      AACOGSTR     
>           414           1.  Low
> 
>            381           2.  Borderline
> 
>            347           3.  Low Normal
> 
>            270           4.  Moderate Normal
> 
>            358           5.  High Normal
>            
> */
. summarize core_proxy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  core_proxy |        815    .7619632    .4261433          0          1

. 
. * Calculate means for the SES vars before subet
. summarize AAGE white black hispanic college_grad female married dementia AACOGSTR core_proxy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        AAGE |        815     81.4638    7.030356         70        110
       white |        815    .7092025    .4544092          0          1
       black |        815    .1877301    .3907362          0          1
    hispanic |        815    .1030675    .3042337          0          1
college_grad |        815    .4822086    .4999902          0          1
-------------+---------------------------------------------------------
      female |        815    .5828221    .4933956          0          1
     married |        815     .393865    .4889056          0          1
    dementia |        815    .3460123    .4759893          0          1
    AACOGSTR |        815    3.030675    1.443546          1          5
  core_proxy |        815    .7619632    .4261433          0          1

. matrix means = r(mean)

. 
. ** set sample inclusion
. 
. egen in_samp = rowmiss(AAGE RELSCORE COGSCORE dementia cogtot27_imp2002 ragender raeduc)

. egen in_samp2 = rowmiss(hurd_p expert_p lasso_p)

. *525 people have no missingness across the board, mostly due to the cogscore variable
. *nobody is missing age
. egen in_AAGE = rowmiss(AAGE)

. *nobody is missing relscore
. egen in_RELSCORE = rowmiss(RELSCORE)

. *927 people missing a cogscore, only 589 people have a full cogscore
. egen in_COGSCORE = rowmiss(COGSCORE)

. *nobody is missing the dementia score
. egen in_dementia = rowmiss(dementia)

. *416 people are missing this score, 1,100 people have a score
. egen in_cogtot27_imp2002 = rowmiss(cogtot27_imp2002)

. *nobody is missing gender or education
. egen in_ragender = rowmiss(ragender)

. count
  815

. 
. preserve

. keep if in_samp2 > 0 | in_samp > 0
(508 observations deleted)

. 
. * Calculate means for those being dropped in the subset
. summarize AAGE white black hispanic college_grad female married dementia AACOGSTR core_proxy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        AAGE |        307    84.40065    7.460948         70        110
       white |        307    .6938111    .4616617          0          1
       black |        307    .1921824    .3946589          0          1
    hispanic |        307    .1140065    .3183381          0          1
college_grad |        307    .3745928    .4848078          0          1
-------------+---------------------------------------------------------
      female |        307    .6286645    .4839508          0          1
     married |        307     .286645    .4529325          0          1
    dementia |        307    .6482085     .478309          0          1
    AACOGSTR |        307    2.081433    1.172902          1          5
  core_proxy |        307    .3680782    .4830701          0          1

. restore

. 
. keep if in_samp == 0
(238 observations deleted)

. count
  577

. keep if in_samp2 == 0
(69 observations deleted)

. count
  508

. 
. * Calculate means for the SES vars after subet
. summarize AAGE white black hispanic college_grad female married dementia AACOGSTR core_proxy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        AAGE |        508    79.68898    6.113789         70         97
       white |        508    .7185039    .4501721          0          1
       black |        508    .1850394    .3887123          0          1
    hispanic |        508    .0964567    .2955075          0          1
college_grad |        508    .5472441    .4982536          0          1
-------------+---------------------------------------------------------
      female |        508    .5551181    .4974426          0          1
     married |        508    .4586614    .4987794          0          1
    dementia |        508    .1633858    .3700818          0          1
    AACOGSTR |        508    3.604331    1.280618          1          5
  core_proxy |        508           1           0          1          1

. 
. * Generate frequency tables for gender, age categories, and education categories
. tab female

     female |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        226       44.49       44.49
          1 |        282       55.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab AAGE_cat

   AAGE_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        258       50.79       50.79
          2 |        250       49.21      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        230       45.28       45.28
          2 |        123       24.21       69.49
          3 |        155       30.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab race_cat

   race_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        365       71.85       71.85
          2 |         94       18.50       90.35
          3 |         49        9.65      100.00
------------+-----------------------------------
      Total |        508      100.00

. 
. *****     10/66    ******
. 
. *************************
. 
. local num_repeats 10

. 
. forvalues r = 1/`num_repeats' {
  2.     set seed `r'010
  3.     
.     gen ranum = uniform()
  4.     sort ranum
  5.     drop ranum
  6.     
.     gen fold_`r' = mod(_n, 10) + 1
  7.     
.     gen k_fold_dem_pred_1066_`r' = .
  8.     
.     forvalues i = 1/10 {  
  9.         local train = "fold_`r' != `i'" 
 10.         local test = "fold_`r' == `i'"  
 11.         
.         quietly logit dementia COGSCORE RELSCORE aRECALLcs if `train'
 12.         quietly predict p_`r'_`i' if `test', pr
 13.         
.         quietly replace k_fold_dem_pred_1066_`r' = p_`r'_`i' if `test'
 14.     }
 15. }
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)

. 
. gen total_pred = k_fold_dem_pred_1066_1 + k_fold_dem_pred_1066_2 + k_fold_dem_pred_1066_3 + k_fold_dem_pred_1066
> _4 + k_fold_dem_pred_1066_5 + k_fold_dem_pred_1066_6 + k_fold_dem_pred_1066_7 + k_fold_dem_pred_1066_8 + k_fold_
> dem_pred_1066_9 + k_fold_dem_pred_1066_10

. 
. gen k_fold_dem_pred_1066_av = total_pred/10

. cutpt dementia k_fold_dem_pred_1066_av

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               k_fold_dem_pred_1066_av
Empirical optimal cutpoint:            .11659183
Sensitivity at cutpoint:               0.95
Specificity at cutpoint:               0.88
Area under ROC curve at cutpoint:      0.92

. 
. * below I'm producing race-specific cutpoints
. foreach r in 1 2 3 {
  2.     preserve 
  3.     keep if race_cat == `r'
  4.     cutpt dementia k_fold_dem_pred_1066_av
  5.     gen k_fold_dem_pred_1066_lat = (k_fold_dem_pred_1066_av >= .88367432) if !missing(k_fold_dem_pred_1066_av
> )
  6.     roctab dementia k_fold_dem_pred_1066_lat
  7.     tab dementia k_fold_dem_pred_1066_lat
  8.     restore
  9.     
.     /* results:
> Empirical cutpoint estimation
> Method:                                Liu
> Reference variable:                    dementia (0=neg, 1=pos)
> Classification variable:               k_fold_dem_pred_1066_av
> Empirical optimal cutpoint:            .08938869
> Sensitivity at cutpoint:               0.98
> Specificity at cutpoint:               0.93
> Area under ROC curve at cutpoint:      0.95
> (414 observations deleted)
> 
> Empirical cutpoint estimation
> Method:                                Liu
> Reference variable:                    dementia (0=neg, 1=pos)
> Classification variable:               k_fold_dem_pred_1066_av
> Empirical optimal cutpoint:            .25129401
> Sensitivity at cutpoint:               0.90
> Specificity at cutpoint:               0.86
> Area under ROC curve at cutpoint:      0.88
> (459 observations deleted)
> 
> Empirical cutpoint estimation
> Method:                                Liu
> Reference variable:                    dementia (0=neg, 1=pos)
> Classification variable:               k_fold_dem_pred_1066_av
> Empirical optimal cutpoint:            .88367432
> Sensitivity at cutpoint:               1.00
> Specificity at cutpoint:               1.00
> Area under ROC curve at cutpoint:      1.00
> */
. }
(143 observations deleted)

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               k_fold_dem_pred_1066_av
Empirical optimal cutpoint:            .08938869
Sensitivity at cutpoint:               0.98
Specificity at cutpoint:               0.93
Area under ROC curve at cutpoint:      0.95

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           365     0.7143       0.0334        0.64889     0.77968

           | k_fold_dem_pred_1066_
           |          lat
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       309          0 |       309 
         1 |        32         24 |        56 
-----------+----------------------+----------
     Total |       341         24 |       365 
(414 observations deleted)

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               k_fold_dem_pred_1066_av
Empirical optimal cutpoint:            .25129401
Sensitivity at cutpoint:               0.90
Specificity at cutpoint:               0.86
Area under ROC curve at cutpoint:      0.88

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
            94     0.7312       0.0563        0.62098     0.84151

           | k_fold_dem_pred_1066_
           |          lat
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |        72          1 |        73 
         1 |        11         10 |        21 
-----------+----------------------+----------
     Total |        83         11 |        94 
(459 observations deleted)

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               k_fold_dem_pred_1066_av
Empirical optimal cutpoint:            .88367432
Sensitivity at cutpoint:               1.00
Specificity at cutpoint:               1.00
Area under ROC curve at cutpoint:      1.00

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
            49     1.0000       0.0000        1.00000     1.00000

           | k_fold_dem_pred_1066_
           |          lat
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |        43          0 |        43 
         1 |         0          6 |         6 
-----------+----------------------+----------
     Total |        43          6 |        49 

. 
. * below I'm running race-specific models to obtain race-specific probabilities 
. 
. local num_repeats 10  

. 
. foreach r in 1 2 3 {
  2.     preserve 
  3.     keep if race_cat == `r'
  4.     quietly {
  5.     forvalues n = 1/`num_repeats' {
  6.         set seed `n'010
  7.         gen ranum_`r' = uniform()
  8.         sort ranum_`r'
  9.         drop ranum_`r'
 10.         
.         gen fold_`n'_`r' = mod(_n, 10) + 1
 11.         gen k_fold_dem_pred_1066_`n'_`r' = .
 12.         
.         display "Running iteration `n' for race category `r'"
 13.         
.         forvalues i = 1/10 {  
 14.             local train "fold_`n'_`r' != `i'"
 15.             local test "fold_`n'_`r' == `i'"
 16.             
.             firthlogit dementia COGSCORE RELSCORE aRECALLcs if `train'
 17.             
.             predict xb_p_`n'_`r'_`i' if `test', xb
 18.             
.             replace xb_p_`n'_`r'_`i' = 20 if xb_p_`n'_`r'_`i' > 20
 19.             replace xb_p_`n'_`r'_`i' = -20 if xb_p_`n'_`r'_`i' < -20
 20.             
.             gen prob_`n'_`r'_`i' = 1 / (1 + exp(-xb_p_`n'_`r'_`i'))
 21.             
.             display "Predicted probabilities for iteration `n' and fold `i':"
 22.             summarize prob_`n'_`r'_`i'
 23.             
.             replace k_fold_dem_pred_1066_`n'_`r' = prob_`n'_`r'_`i' if `test'
 24.         }
 25.         }
 26.     }
 27.     
.     * Aggregate predicted probabilities across folds
.     gen total_pred_`r' = 0
 28.     forvalues i = 1/10 {
 29.         replace total_pred_`r' = total_pred_`r' + k_fold_dem_pred_1066_`i'_`r'
 30.     }
 31.     keep hhidpn total_pred_`r'
 32.     save data/total_pred_`r'.dta, replace
 33.     restore
 34. }
(143 observations deleted)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
(365 real changes made)
file data/total_pred_1.dta saved
(414 observations deleted)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
(94 real changes made)
file data/total_pred_2.dta saved
(459 observations deleted)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
(49 real changes made)
file data/total_pred_3.dta saved

. 
. merge 1:1 hhidpn using "data/total_pred_1.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           143
        from master                       143  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               365  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 hhidpn using "data/total_pred_2.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           414
        from master                       414  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                94  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 hhidpn using "data/total_pred_3.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           459
        from master                       459  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                49  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. gen total_pred_race_specific = total_pred_1
(143 missing values generated)

. replace total_pred_race_specific = total_pred_2 if total_pred_race_specific == .
(94 real changes made)

. replace total_pred_race_specific = total_pred_3 if total_pred_race_specific == .
(49 real changes made)

. 
. gen k_fold_dem_pred_1066_av_rs = total_pred_race_specific/10

. 
. * using optimal cutpoints, everyone
. gen k_fold_dem_pred_1066_opt = (k_fold_dem_pred_1066_av >= .11659183) if !missing(k_fold_dem_pred_1066_av)

. tab dementia k_fold_dem_pred_1066_opt, matcell(conf_matrix)

           | k_fold_dem_pred_1066_
           |          opt
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       376         49 |       425 
         1 |         4         79 |        83 
-----------+----------------------+----------
     Total |       380        128 |       508 

. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  376   49
r2    4   79

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
128

. 
. display "Sensitivity for 1066 .25: " Sensitivity
Sensitivity for 1066 .25: .95180723

. display "Specificity for 1066 .25: " Specificity
Specificity for 1066 .25: .88470588

. display "Accuracy for 1066 .25: " Accuracy
Accuracy for 1066 .25: .89566929

. display "Predicted Prevalence for 1066 optimal: " Prevalence
Predicted Prevalence for 1066 optimal: 25.19685

. 
. roctab dementia k_fold_dem_pred_1066_opt

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.9183       0.0141        0.89054     0.94597

. 
. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. 
. * using ascribed cutpoint of .25, everyone
. 
. gen dem_pred_bin_1066a25 = (k_fold_dem_pred_1066_av >= .25) if !missing(k_fold_dem_pred_1066_av)

. 
. tab dem_pred_bin_1066a25

dem_pred_bi |
  n_1066a25 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        406       79.92       79.92
          1 |        102       20.08      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_bin_1066a25, matcell(conf_matrix)

           | dem_pred_bin_1066a25
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       395         30 |       425 
         1 |        11         72 |        83 
-----------+----------------------+----------
     Total |       406        102 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  395   30
r2   11   72

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
102

. 
. display "Sensitivity for 1066 .25: " Sensitivity
Sensitivity for 1066 .25: .86746988

. display "Specificity for 1066 .25: " Specificity
Specificity for 1066 .25: .92941176

. display "Accuracy for 1066 .25: " Accuracy
Accuracy for 1066 .25: .91929134

. display "Predicted Prevalence for 1066 .25: " Prevalence
Predicted Prevalence for 1066 .25: 20.07874

. 
. roctab dementia dem_pred_bin_1066a25

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8984       0.0197        0.85977     0.93711

. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. 
. * using race-specific optimal cutpoints
. gen dem_pred_bin_1066_opt_rs = 0

. replace dem_pred_bin_1066_opt_rs = 1 if (k_fold_dem_pred_1066_av >= .08938869) & (!missing(k_fold_dem_pred_1066_
> av) & race_cat == 1)
(78 real changes made)

. replace dem_pred_bin_1066_opt_rs = 1 if (k_fold_dem_pred_1066_av >= .25129401) & (!missing(k_fold_dem_pred_1066_
> av) & race_cat == 2)
(29 real changes made)

. replace dem_pred_bin_1066_opt_rs = 1 if (k_fold_dem_pred_1066_av >= .88367432) & (!missing(k_fold_dem_pred_1066_
> av) & race_cat == 3)
(6 real changes made)

. 
. tab dem_pred_bin_1066_opt_rs

dem_pred_bi |
n_1066_opt_ |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        395       77.76       77.76
          1 |        113       22.24      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_bin_1066_opt_rs, matcell(conf_matrix)

           | dem_pred_bin_1066_opt
           |          _rs
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       392         33 |       425 
         1 |         3         80 |        83 
-----------+----------------------+----------
     Total |       395        113 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  392   33
r2    3   80

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
113

. 
. display "Sensitivity for 1066 optimal race specific: " Sensitivity
Sensitivity for 1066 optimal race specific: .96385542

. display "Specificity for 1066 optimal race specific: " Specificity
Specificity for 1066 optimal race specific: .92235294

. display "Accuracy for 1066 optimal race specific: " Accuracy
Accuracy for 1066 optimal race specific: .92913386

. display "Predicted Prevalence for 1066 optimal race specific: " Prevalence
Predicted Prevalence for 1066 optimal race specific: 22.244094

. 
. roctab dementia dem_pred_bin_1066_opt_rs

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.9431       0.0122        0.91922     0.96698

. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. 
. * using ascribed cutpoint of .25 with race specific probabilities
. 
. gen dem_pred_bin_1066a25_rs = (k_fold_dem_pred_1066_av_rs >= .25) if !missing(k_fold_dem_pred_1066_av_rs)

. tab dem_pred_bin_1066a25_rs

dem_pred_bi |
n_1066a25_r |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        406       79.92       79.92
          1 |        102       20.08      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_bin_1066a25_rs, matcell(conf_matrix)

           | dem_pred_bin_1066a25_
           |          rs
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       397         28 |       425 
         1 |         9         74 |        83 
-----------+----------------------+----------
     Total |       406        102 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  397   28
r2    9   74

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
102

. 
. display "Sensitivity for 1066 .25 race specific: " Sensitivity
Sensitivity for 1066 .25 race specific: .89156627

. display "Specificity for 1066 .25 race specific: " Specificity
Specificity for 1066 .25 race specific: .93411765

. display "Accuracy for 1066 .25 race specific: " Accuracy
Accuracy for 1066 .25 race specific: .92716535

. display "Predicted Prevalence for 1066 .25 race specific: " Prevalence
Predicted Prevalence for 1066 .25 race specific: 20.07874

. 
. roctab dementia dem_pred_bin_1066a25_rs

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.9128       0.0182        0.87718     0.94850

. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. *****  hrs, tics   ******
. 
. *************************
. 
. gen cogtot27_imp2002_binary = 2 if cogtot27_imp2002 <7
(417 missing values generated)

. replace cogtot27_imp2002_binary = 0 if cogtot27_imp2002 >6
(417 real changes made)

. 
. gen cogtot27_imp2002_categorical = 2 if cogtot27_imp2002 < 7
(417 missing values generated)

. replace cogtot27_imp2002_categorical = 1 if cogtot27_imp2002 >= 7 & cogtot27_imp2002 < 12
(174 real changes made)

. replace cogtot27_imp2002_categorical = 0 if cogtot27_imp2002 >= 12
(243 real changes made)

. 
. * binary cutpoint based on ascribed less than or equal to 6
. 
. gen dem_pred_lwa = 0

. replace dem_pred_lwa = 1 if cogtot27_imp2002 >= 0 & cogtot27_imp2002 <= 6
(91 real changes made)

. 
. 
. tab dem_pred_lwa

dem_pred_lw |
          a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        417       82.09       82.09
          1 |         91       17.91      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_lwa, matcell(conf_matrix)

           |     dem_pred_lwa
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       373         52 |       425 
         1 |        44         39 |        83 
-----------+----------------------+----------
     Total |       417         91 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  373   52
r2   44   39

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for tics ascribed: " Sensitivity
Sensitivity for tics ascribed: .46987952

. display "Specificity for tics ascribed: " Specificity
Specificity for tics ascribed: .87764706

. display "Accuracy for tics ascribed: " Accuracy
Accuracy for tics ascribed: .81102362

. 
. display "Predicted Prevalence from HRS TICS ascribed: " Prevalence
Predicted Prevalence from HRS TICS ascribed: 17.913386

. 
. roctab dementia dem_pred_lwa

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.6738       0.0287        0.61754     0.72998

. 
. *****  expert *****
. 
. *******************
. tabulate dementia expert_dem, matcell(conf_matrix)

           |      expert_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       359         66 |       425 
         1 |        22         61 |        83 
-----------+----------------------+----------
     Total |       381        127 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  359   66
r2   22   61

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for expert ascribed: " Sensitivity
Sensitivity for expert ascribed: .73493976

. display "Specificity for expert ascribed: " Specificity
Specificity for expert ascribed: .84470588

. display "Accuracy for expert ascribed: " Accuracy
Accuracy for expert ascribed: .82677165

. display "Predicted Prevalence for expert ascribed: " Prevalence
Predicted Prevalence for expert ascribed: 25

. 
. roctab dementia expert_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.7898       0.0259        0.73904     0.84060

. 
. *****  hurd  *****
. 
. ******************
. tabulate dementia hurd_dem, matcell(conf_matrix)

           |       hurd_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       361         64 |       425 
         1 |        20         63 |        83 
-----------+----------------------+----------
     Total |       381        127 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  361   64
r2   20   63

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for hurd ascribed: " Sensitivity
Sensitivity for hurd ascribed: .75903614

. display "Specificity for hurd ascribed: " Specificity
Specificity for hurd ascribed: .84941176

. display "Accuracy for hurd ascribed: " Accuracy
Accuracy for hurd ascribed: .83464567

. display "Predicted Prevalence for hurd ascribed: " Prevalence
Predicted Prevalence for hurd ascribed: 25

. roctab dementia hurd_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8042       0.0252        0.75491     0.85354

. 
. ******  lasso  *******
. 
. **********************
. tabulate dementia lasso_dem, matcell(conf_matrix)

           |       lasso_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       343         82 |       425 
         1 |        14         69 |        83 
-----------+----------------------+----------
     Total |       357        151 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  343   82
r2   14   69

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for lasso ascribed: " Sensitivity
Sensitivity for lasso ascribed: .8313253

. display "Specificity for lasso ascribed: " Specificity
Specificity for lasso ascribed: .80705882

. display "Accuracy for lasso ascribed: " Accuracy
Accuracy for lasso ascribed: .81102362

. display "Predicted Prevalence for lasso ascribed: " Prevalence
Predicted Prevalence for lasso ascribed: 29.724409

. 
. roctab dementia lasso_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8192       0.0228        0.77453     0.86386

. 
. ** education gradients
. foreach dem_var in dementia k_fold_dem_pred_1066_opt dem_pred_bin_1066a25 dem_pred_bin_1066_opt_rs dem_pred_bin_
> 1066a25_rs dem_pred_lwa expert_dem hurd_dem lasso_dem {
  2.         qui: logit `dem_var' ib2.educat AAGE AAGE2 if AAGE_cat
  3.         margins educat, post  // Only use 'post' if necessary
  4.         eststo `dem_var'
  5. }

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1794954   .0234318     7.66   0.000     .1335699    .2254209
          2  |   .1823686   .0334809     5.45   0.000     .1167474    .2479899
          3  |   .1233707    .025516     4.84   0.000     .0733602    .1733812
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(k_fold_dem_pred_1066_opt), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3375032     .02907    11.61   0.000     .2805271    .3944794
          2  |   .2402902   .0363372     6.61   0.000     .1690707    .3115097
          3  |   .1319287   .0258917     5.10   0.000     .0811819    .1826754
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2649386   .0271573     9.76   0.000     .2117112     .318166
          2  |   .1814698   .0335346     5.41   0.000     .1157432    .2471965
          3  |   .1167988   .0250818     4.66   0.000     .0676393    .1659583
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066_opt_rs), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2672667   .0266417    10.03   0.000       .21505    .3194835
          2  |   .2584834   .0367508     7.03   0.000     .1864531    .3305137
          3  |   .1258087   .0251485     5.00   0.000     .0765186    .1750987
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25_rs), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2556715   .0266083     9.61   0.000     .2035202    .3078228
          2  |   .1990917   .0343937     5.79   0.000     .1316812    .2665021
          3  |   .1172982   .0249656     4.70   0.000     .0683665    .1662299
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_lwa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3003222   .0295536    10.16   0.000     .2423981    .3582462
          2  |   .1264482   .0299699     4.22   0.000     .0677083    .1851882
          3  |   .0338317   .0147733     2.29   0.022     .0048765    .0627868
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(expert_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |    .300489   .0264521    11.36   0.000     .2486439    .3523341
          2  |   .2888494   .0371461     7.78   0.000     .2160444    .3616545
          3  |   .1430562   .0263761     5.42   0.000     .0913601    .1947524
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(hurd_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2962691    .026624    11.13   0.000     .2440869    .3484512
          2  |   .2708016   .0367277     7.37   0.000     .1988166    .3427865
          3  |   .1636357   .0275453     5.94   0.000     .1096479    .2176235
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(lasso_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3743458   .0286406    13.07   0.000     .3182112    .4304805
          2  |   .3034379   .0381187     7.96   0.000     .2287267    .3781491
          3  |   .1769396   .0284318     6.22   0.000     .1212143    .2326649
------------------------------------------------------------------------------

. ** race gradients
. foreach dem_var in dementia k_fold_dem_pred_1066_opt dem_pred_bin_1066a25 dem_pred_bin_1066_opt_rs dem_pred_bin_
> 1066a25_rs dem_pred_lwa expert_dem hurd_dem lasso_dem {
  2.         qui: logit `dem_var' ib2.race_cat AAGE AAGE2 if AAGE_cat
  3.         margins race_cat, post  // Only use 'post' if necessary
  4.         eststo `dem_var'
  5. }

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .1553078   .0179197     8.67   0.000     .1201859    .1904298
          2  |   .2027939   .0383902     5.28   0.000     .1275505    .2780374
          3  |   .1427697   .0498537     2.86   0.004     .0450582    .2404811
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(k_fold_dem_pred_1066_opt), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .2055161   .0196318    10.47   0.000     .1670384    .2439937
          2  |    .337077   .0455783     7.40   0.000     .2477452    .4264087
          3  |   .4394039   .0663469     6.62   0.000     .3093664    .5694413
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .1609609    .018182     8.85   0.000     .1253249     .196597
          2  |   .2860896   .0435193     6.57   0.000     .2007934    .3713859
          3  |   .3375856   .0641872     5.26   0.000      .211781    .4633901
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066_opt_rs), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .2165329   .0198443    10.91   0.000     .1776387     .255427
          2  |   .2828049   .0428572     6.60   0.000     .1988064    .3668034
          3  |   .1445102   .0487705     2.96   0.003     .0489217    .2400986
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25_rs), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .1802626   .0188809     9.55   0.000     .1432567    .2172685
          2  |   .2749291   .0428182     6.42   0.000      .191007    .3588511
          3  |   .2094464   .0563417     3.72   0.000     .0990188    .3198741
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_lwa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |    .113415   .0163894     6.92   0.000     .0812924    .1455376
          2  |   .3569115   .0483121     7.39   0.000     .2622214    .4516015
          3  |    .324717   .0660913     4.91   0.000     .1951804    .4542536
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(expert_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .2287445   .0197535    11.58   0.000     .1900283    .2674606
          2  |    .338117   .0431573     7.83   0.000     .2535302    .4227038
          3  |     .23796   .0575496     4.13   0.000     .1251649     .350755
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(hurd_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |   .2264165   .0196852    11.50   0.000     .1878342    .2649987
          2  |   .2943615   .0419021     7.02   0.000     .2122349    .3764882
          3  |   .3478742   .0621213     5.60   0.000     .2261188    .4696297
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(lasso_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    race_cat |
          1  |    .270105   .0209994    12.86   0.000      .228947     .311263
          2  |   .3590343   .0449267     7.99   0.000     .2709795    .4470891
          3  |   .3876015   .0639523     6.06   0.000     .2622572    .5129457
------------------------------------------------------------------------------

. 
. *tabulating to see distribution
. tab AAGE_cat k_fold_dem_pred_1066_opt

           | k_fold_dem_pred_1066_
           |          opt
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       220         38 |       258 
         2 |       160         90 |       250 
-----------+----------------------+----------
     Total |       380        128 |       508 

. tab AAGE_cat dem_pred_bin_1066a25

           | dem_pred_bin_1066a25
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       230         28 |       258 
         2 |       176         74 |       250 
-----------+----------------------+----------
     Total |       406        102 |       508 

. tab AAGE_cat dem_pred_lwa

           |     dem_pred_lwa
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       223         35 |       258 
         2 |       194         56 |       250 
-----------+----------------------+----------
     Total |       417         91 |       508 

. tab AAGE_cat expert_dem

           |      expert_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       232         26 |       258 
         2 |       149        101 |       250 
-----------+----------------------+----------
     Total |       381        127 |       508 

. tab AAGE_cat hurd_dem

           |       hurd_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       231         27 |       258 
         2 |       150        100 |       250 
-----------+----------------------+----------
     Total |       381        127 |       508 

. tab AAGE_cat lasso_dem

           |       lasso_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       217         41 |       258 
         2 |       140        110 |       250 
-----------+----------------------+----------
     Total |       357        151 |       508 

. tab educat dem_pred_lwa

           |     dem_pred_lwa
    educat |         0          1 |     Total
-----------+----------------------+----------
         1 |       159         71 |       230 
         2 |       108         15 |       123 
         3 |       150          5 |       155 
-----------+----------------------+----------
     Total |       417         91 |       508 

. 
. * Mean and SD for COGSCORE
. summarize COGSCORE

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    COGSCORE |        508    14.27912    2.513749          5    17.1875

. 
. * Mean and SD for RELSCORE
. summarize RELSCORE

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    RELSCORE |        508    1.553072    2.110364          0       13.5

. 
. * Mean and SD for 10 Word delayed recall
. summarize aRECALLcs

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   aRECALLcs |        508    4.541339     2.50606          0         10

. 
. * Frequency distribution for Sex
. tabulate ragender

ragender: r |
     gender |      Freq.     Percent        Cum.
------------+-----------------------------------
     1.male |        226       44.49       44.49
   2.female |        282       55.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. 
. * Frequency distribution for Age
. tabulate AAGE_cat

   AAGE_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        258       50.79       50.79
          2 |        250       49.21      100.00
------------+-----------------------------------
      Total |        508      100.00

. summarize AAGE

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        AAGE |        508    79.68898    6.113789         70         97

. 
. * Frequency distribution for Education
. tabulate educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        230       45.28       45.28
          2 |        123       24.21       69.49
          3 |        155       30.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. summarize EDYRS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       EDYRS |        508    10.76378    4.136157          0         17

. 
. 
. log close
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive_98_to_0.log
  log type:  text
 closed on:  10 Oct 2024, 22:00:44
------------------------------------------------------------------------------------------------------------------
