---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive_98_to_0.log
  log type:  text
 opened on:  17 May 2024, 21:14:41

. 
. ** set sample inclusion
. egen in_samp = rowmiss(AAGE RELSCORE COGSCORE dementia cogtot27_imp2002 ragender raed
> uc)

. *525 people have no missingness across the board, mostly due to the cogscore variable
. *nobody is missing age
. egen in_AAGE = rowmiss(AAGE)

. *nobody is missing relscore
. egen in_RELSCORE = rowmiss(RELSCORE)

. *927 people missing a cogscore, only 589 people have a full cogscore
. egen in_COGSCORE = rowmiss(COGSCORE)

. *nobody is missing the dementia score
. egen in_dementia = rowmiss(dementia)

. *416 people are missing this score, 1,100 people have a score
. egen in_cogtot27_imp2002 = rowmiss(cogtot27_imp2002)

. *nobody is missing gender or education
. egen in_ragender = rowmiss(ragender)

. keep if in_samp == 0
(939 observations deleted)

. count
  577

. egen in_samp2 = rowmiss(hurd_p expert_p lasso_p)

. 
. keep if in_samp2 == 0
(69 observations deleted)

. count
  508

. 
. ** table 2 **
. tab female

     female |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        226       44.49       44.49
          1 |        282       55.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab AAGE_cat

   AAGE_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        258       50.79       50.79
          2 |        250       49.21      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        230       45.28       45.28
          2 |        123       24.21       69.49
          3 |        155       30.51      100.00
------------+-----------------------------------
      Total |        508      100.00

. 
. 
. ** table 3 **
. ** identify cutpoints to maximize sensitivity and specificity [optimal]
. * http://www.haghish.com/statistics/stata-blog/stata-programming/download/cutpt.html
. 
. *****  1066 *****
. 
. *****************
. 
. * optimal
. 
. local num_repeats 10

. 
. forvalues r = 1/`num_repeats' {
  2.     set seed `r'010
  3.     
.     gen ranum = uniform()
  4.     sort ranum
  5.     drop ranum
  6.     
.     gen fold_`r' = mod(_n, 10) + 1
  7.     
.     gen k_fold_dem_pred_1066_`r' = .
  8.     
.     forvalues i = 1/10 {  
  9.         local train = "fold_`r' != `i'" 
 10.         local test = "fold_`r' == `i'"  
 11.         
.         quietly logit dementia COGSCORE RELSCORE aRECALLcs if `train'
 12.         quietly predict p_`r'_`i' if `test', pr
 13.         
.         quietly replace k_fold_dem_pred_1066_`r' = p_`r'_`i' if `test'
 14.     }
 15. }
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)
(508 missing values generated)

. 
. gen total_pred = k_fold_dem_pred_1066_1 + k_fold_dem_pred_1066_2 + k_fold_dem_pred_10
> 66_3 + k_fold_dem_pred_1066_4 + k_fold_dem_pred_1066_5 + k_fold_dem_pred_1066_6 + k_f
> old_dem_pred_1066_7 + k_fold_dem_pred_1066_8 + k_fold_dem_pred_1066_9 + k_fold_dem_pr
> ed_1066_10

. 
. gen k_fold_dem_pred_1066_av = total_pred/10

. 
. cutpt dementia k_fold_dem_pred_1066_av

Empirical cutpoint estimation
Method:                                Liu
Reference variable:                    dementia (0=neg, 1=pos)
Classification variable:               k_fold_dem_pred_1066_av
Empirical optimal cutpoint:            .11659183
Sensitivity at cutpoint:               0.95
Specificity at cutpoint:               0.88
Area under ROC curve at cutpoint:      0.92

. 
. gen k_fold_dem_pred_1066_opt = (k_fold_dem_pred_1066_av >= .1277115) if !missing(k_fo
> ld_dem_pred_1066_av)

. tab dementia k_fold_dem_pred_1066_opt, matcell(conf_matrix)

           | k_fold_dem_pred_1066_
           |          opt
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       377         48 |       425 
         1 |         5         78 |        83 
-----------+----------------------+----------
     Total |       382        126 |       508 

. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  377   48
r2    5   78

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
126

. 
. display "Sensitivity for 1066 .25: " Sensitivity
Sensitivity for 1066 .25: .93975904

. display "Specificity for 1066 .25: " Specificity
Specificity for 1066 .25: .88705882

. display "Accuracy for 1066 .25: " Accuracy
Accuracy for 1066 .25: .89566929

. display "Predicted Prevalence for 1066 optimal: " Prevalence
Predicted Prevalence for 1066 optimal: 24.80315

. 
. roctab dementia k_fold_dem_pred_1066_opt

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.9134       0.0152        0.88358     0.94324

. rocreg dementia k_fold_dem_pred_1066_av
(running rocregstat on estimation sample)

Bootstrap replications (1,000): .........10.........20.........30.........40.........50
> .........60.........70.........80.........90.........100.........110.........120.....
> ....130.........140.........150.........160.........170.........180.........190......
> ...200.........210.........220.........230.........240.........250.........260.......
> ..270.........280.........290.........300.........310.........320.........330........
> .340.........350.........360.........370.........380.........390.........400.........
> 410.........420.........430.........440.........450.........460.........470.........4
> 80.........490.........500.........510.........520.........530.........540.........55
> 0.........560.........570.........580.........590.........600.........610.........620
> .........630.........640.........650.........660.........670.........680.........690.
> ........700.........710.........720.........730.........740.........750.........760..
> .......770.........780.........790.........800.........810.........820.........830...
> ......840.........850.........860.........870.........880.........890.........900....
> .....910.........920.........930.........940.........950.........960.........970.....
> ....980.........990.........1,000 done

Bootstrap results                                        Number of obs =   508
                                                         Replications  = 1,000

Nonparametric ROC estimation

Control standardization: empirical
ROC method             : empirical

Area under the ROC curve

   Status    : dementia
   Classifier: k_fold_dem_pred_1066_av
------------------------------------------------------------------------------
             |    Observed               Bootstrap
         AUC | coefficient       Bias    std. err.     [95% conf. interval]
-------------+----------------------------------------------------------------
             |    .9707725   8.00e-06    .0067128     .9576157   .9839293  (N)
             |                                        .9564431   .9828872  (P)
             |                                        .9562438   .9824802 (BC)
------------------------------------------------------------------------------

. 
. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. *ascribed
. gen dem_pred_bin_1066a25 = (k_fold_dem_pred_1066_av >= .25) if !missing(k_fold_dem_pr
> ed_1066_av)

. tab dem_pred_bin_1066a25

dem_pred_bi |
  n_1066a25 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        406       79.92       79.92
          1 |        102       20.08      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_bin_1066a25, matcell(conf_matrix)

           | dem_pred_bin_1066a25
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       395         30 |       425 
         1 |        11         72 |        83 
-----------+----------------------+----------
     Total |       406        102 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  395   30
r2   11   72

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. display TP+FP
102

. 
. display "Sensitivity for 1066 .25: " Sensitivity
Sensitivity for 1066 .25: .86746988

. display "Specificity for 1066 .25: " Specificity
Specificity for 1066 .25: .92941176

. display "Accuracy for 1066 .25: " Accuracy
Accuracy for 1066 .25: .91929134

. display "Predicted Prevalence for 1066 .25: " Prevalence
Predicted Prevalence for 1066 .25: 20.07874

. 
. roctab dementia dem_pred_bin_1066a25

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8984       0.0197        0.85977     0.93711

. matrix drop conf_matrix

. scalar drop TN FN FP TP Sensitivity Specificity Accuracy Prevalence

. 
. *****  hrs, tics   ******
. 
. *************************
. 
. gen cogtot27_imp2002_binary = 2 if cogtot27_imp2002 <7
(417 missing values generated)

. replace cogtot27_imp2002_binary = 0 if cogtot27_imp2002 >6
(417 real changes made)

. 
. gen cogtot27_imp2002_categorical = 2 if cogtot27_imp2002 < 7
(417 missing values generated)

. replace cogtot27_imp2002_categorical = 1 if cogtot27_imp2002 >= 7 & cogtot27_imp2002 
> < 12
(174 real changes made)

. replace cogtot27_imp2002_categorical = 0 if cogtot27_imp2002 >= 12
(243 real changes made)

. 
. *binary tics
. gen dem_pred_lwa = 0

. replace dem_pred_lwa = 1 if cogtot27_imp2002 >= 0 & cogtot27_imp2002 <= 6
(91 real changes made)

. 
. 
. tab dem_pred_lwa

dem_pred_lw |
          a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        417       82.09       82.09
          1 |         91       17.91      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab dementia dem_pred_lwa, matcell(conf_matrix)

           |     dem_pred_lwa
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       373         52 |       425 
         1 |        44         39 |        83 
-----------+----------------------+----------
     Total |       417         91 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  373   52
r2   44   39

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for tics ascribed: " Sensitivity
Sensitivity for tics ascribed: .46987952

. display "Specificity for tics ascribed: " Specificity
Specificity for tics ascribed: .87764706

. display "Accuracy for tics ascribed: " Accuracy
Accuracy for tics ascribed: .81102362

. 
. display "Predicted Prevalence from HRS TICS ascribed: " Prevalence
Predicted Prevalence from HRS TICS ascribed: 17.913386

. 
. roctab dementia dem_pred_lwa

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.6738       0.0287        0.61754     0.72998

. 
. *****  expert *****
. 
. *******************
. tabulate dementia expert_dem, matcell(conf_matrix)

           |      expert_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       359         66 |       425 
         1 |        22         61 |        83 
-----------+----------------------+----------
     Total |       381        127 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  359   66
r2   22   61

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for expert ascribed: " Sensitivity
Sensitivity for expert ascribed: .73493976

. display "Specificity for expert ascribed: " Specificity
Specificity for expert ascribed: .84470588

. display "Accuracy for expert ascribed: " Accuracy
Accuracy for expert ascribed: .82677165

. display "Predicted Prevalence for expert ascribed: " Prevalence
Predicted Prevalence for expert ascribed: 25

. 
. roctab dementia expert_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.7898       0.0259        0.73904     0.84060

. 
. *****  hurd  *****
. 
. ******************
. tabulate dementia hurd_dem, matcell(conf_matrix)

           |       hurd_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       361         64 |       425 
         1 |        20         63 |        83 
-----------+----------------------+----------
     Total |       381        127 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  361   64
r2   20   63

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for hurd ascribed: " Sensitivity
Sensitivity for hurd ascribed: .75903614

. display "Specificity for hurd ascribed: " Specificity
Specificity for hurd ascribed: .84941176

. display "Accuracy for hurd ascribed: " Accuracy
Accuracy for hurd ascribed: .83464567

. display "Predicted Prevalence for hurd ascribed: " Prevalence
Predicted Prevalence for hurd ascribed: 25

. roctab dementia hurd_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8042       0.0252        0.75491     0.85354

. 
. ******  lasso  *******
. 
. **********************
. tabulate dementia lasso_dem, matcell(conf_matrix)

           |       lasso_dem
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       343         82 |       425 
         1 |        14         69 |        83 
-----------+----------------------+----------
     Total |       357        151 |       508 

. 
. matrix list conf_matrix

conf_matrix[2,2]
     c1   c2
r1  343   82
r2   14   69

. 
. scalar TN = conf_matrix[1,1]

. scalar FN = conf_matrix[2,1]

. scalar FP = conf_matrix[1,2]

. scalar TP = conf_matrix[2,2]

. 
. scalar Sensitivity = TP / (TP + FN)

. scalar Specificity = TN / (TN + FP)

. scalar Accuracy = (TP + TN) / (TP + TN + FP + FN)

. scalar Prevalence = ((TP+FP) / (TP + TN + FP + FN))*100

. 
. display "Sensitivity for lasso ascribed: " Sensitivity
Sensitivity for lasso ascribed: .8313253

. display "Specificity for lasso ascribed: " Specificity
Specificity for lasso ascribed: .80705882

. display "Accuracy for lasso ascribed: " Accuracy
Accuracy for lasso ascribed: .81102362

. display "Predicted Prevalence for lasso ascribed: " Prevalence
Predicted Prevalence for lasso ascribed: 29.724409

. 
. roctab dementia lasso_dem

                      ROC                     Asymptotic normal  
           Obs       area     Std. err.      [95% conf. interval]
     ------------------------------------------------------------
           508     0.8192       0.0228        0.77453     0.86386

. 
. ** education gradients [for all cutpoints]
. foreach dem_var in dementia k_fold_dem_pred_1066_opt dem_pred_bin_1066a25 dem_pred_lw
> a expert_dem hurd_dem lasso_dem {
  2.         qui: logit `dem_var' ib2.educat AAGE AAGE2 if AAGE_cat
  3.         margins educat, post  // Only use 'post' if necessary
  4.         eststo `dem_var'
  5. }

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dementia), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .1794954   .0234318     7.66   0.000     .1335699    .2254209
          2  |   .1823686   .0334809     5.45   0.000     .1167474    .2479899
          3  |   .1233707    .025516     4.84   0.000     .0733602    .1733812
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(k_fold_dem_pred_1066_opt), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3334011   .0290256    11.49   0.000     .2765121    .3902902
          2  |   .2319703   .0361191     6.42   0.000     .1611782    .3027623
          3  |   .1312558   .0260013     5.05   0.000     .0802942    .1822174
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_bin_1066a25), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2649386   .0271573     9.76   0.000     .2117112     .318166
          2  |   .1814698   .0335346     5.41   0.000     .1157432    .2471965
          3  |   .1167988   .0250818     4.66   0.000     .0676393    .1659583
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(dem_pred_lwa), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3003222   .0295536    10.16   0.000     .2423981    .3582462
          2  |   .1264482   .0299699     4.22   0.000     .0677083    .1851882
          3  |   .0338317   .0147733     2.29   0.022     .0048765    .0627868
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(expert_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |    .300489   .0264521    11.36   0.000     .2486439    .3523341
          2  |   .2888494   .0371461     7.78   0.000     .2160444    .3616545
          3  |   .1430562   .0263761     5.42   0.000     .0913601    .1947524
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(hurd_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .2962691    .026624    11.13   0.000     .2440869    .3484512
          2  |   .2708016   .0367277     7.37   0.000     .1988166    .3427865
          3  |   .1636357   .0275453     5.94   0.000     .1096479    .2176235
------------------------------------------------------------------------------

Predictive margins                                         Number of obs = 508
Model VCE: OIM

Expression: Pr(lasso_dem), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      educat |
          1  |   .3743458   .0286406    13.07   0.000     .3182112    .4304805
          2  |   .3034379   .0381187     7.96   0.000     .2287267    .3781491
          3  |   .1769396   .0284318     6.22   0.000     .1212143    .2326649
------------------------------------------------------------------------------

. 
. *tabulating to see distribution
. tab AAGE_cat k_fold_dem_pred_1066_opt

           | k_fold_dem_pred_1066_
           |          opt
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       221         37 |       258 
         2 |       161         89 |       250 
-----------+----------------------+----------
     Total |       382        126 |       508 

. tab AAGE_cat dem_pred_bin_1066a25

           | dem_pred_bin_1066a25
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       230         28 |       258 
         2 |       176         74 |       250 
-----------+----------------------+----------
     Total |       406        102 |       508 

. tab AAGE_cat dem_pred_lwa

           |     dem_pred_lwa
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       223         35 |       258 
         2 |       194         56 |       250 
-----------+----------------------+----------
     Total |       417         91 |       508 

. tab AAGE_cat expert_dem

           |      expert_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       232         26 |       258 
         2 |       149        101 |       250 
-----------+----------------------+----------
     Total |       381        127 |       508 

. tab AAGE_cat hurd_dem

           |       hurd_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       231         27 |       258 
         2 |       150        100 |       250 
-----------+----------------------+----------
     Total |       381        127 |       508 

. tab AAGE_cat lasso_dem

           |       lasso_dem
  AAGE_cat |         0          1 |     Total
-----------+----------------------+----------
         1 |       217         41 |       258 
         2 |       140        110 |       250 
-----------+----------------------+----------
     Total |       357        151 |       508 

. tab educat dem_pred_lwa

           |     dem_pred_lwa
    educat |         0          1 |     Total
-----------+----------------------+----------
         1 |       159         71 |       230 
         2 |       108         15 |       123 
         3 |       150          5 |       155 
-----------+----------------------+----------
     Total |       417         91 |       508 

. 
. *there are no cases of dementia in the younger group for the langa-weir
. tabulate AAGE_cat educat if dem_pred_lwa == 1

           |              educat
  AAGE_cat |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 |        30          5          0 |        35 
         2 |        41         10          5 |        56 
-----------+---------------------------------+----------
     Total |        71         15          5 |        91 

. 
. tab educat hurd_dem

           |       hurd_dem
    educat |         0          1 |     Total
-----------+----------------------+----------
         1 |       158         72 |       230 
         2 |        92         31 |       123 
         3 |       131         24 |       155 
-----------+----------------------+----------
     Total |       381        127 |       508 

. tab educat lasso_dem

           |       lasso_dem
    educat |         0          1 |     Total
-----------+----------------------+----------
         1 |       140         90 |       230 
         2 |        88         35 |       123 
         3 |       129         26 |       155 
-----------+----------------------+----------
     Total |       357        151 |       508 

. 
. log close
      name:  <unnamed>
       log:  /hdir/0/chrissoria/1066/ADAMS_1066_aggressive_98_to_0.log
  log type:  text
 closed on:  17 May 2024, 21:14:55
---------------------------------------------------------------------------------------
